{"task_id":"codestart_1","question": "In Academic Medicine, in what year did David Sklar introduce the Innovation Reports?", "true_answer": "2013"}
{"task_id":"codestart_2","question": "According to the Home page of the Journal of Medical Case Reports, what is the requirement for including patient ethnicity in abstracts?", "true_answer": "Patient ethnicity must be included in the Abstract under the Case Presentation section"}
{"task_id":"codestart_3","question": "According to Figure 'DA margin 4.7%' in the Talkpool Interim Report Q1 2025, what DA margin is reported?", "true_answer": "4.7"}
{"task_id":"codestart_4","question": "According to the BBC News 'Spring Statement 2025: Key points at a glance', what is the forecasted average inflation rate for the current year?", "true_answer": "3.2"}
{"task_id":"codestart_5","question": "What is the section of The Japan News website dedicated to news specifically categorized under Politics?", "true_answer": "Japanese Government & Politics | Latest News from Japan - The Japan News"}
{"task_id":"codestart_6","question": "When was the document 'Claude vs ChatGPT: Selecting the Ideal AI Writing Assistant for Academic Writing' posted? Answer with YYYY-MM-DD format.", "true_answer": "2024-07-05"}
{"task_id":"codestart_7","question": "When was the arXiv version v1 of the paper 'Inference with few treated units' published? Answer with YYYY-MM-DD format.", "true_answer": "2025-04-28"}
{"task_id":"codestart_8","question": "What is the amount of FEMA's FY 2025 Gross Discretionary Budget in the FY 2025 Budget in Brief?", "true_answer": "28154155000"}
{"task_id":"codestart_9","question": "What was the first work of the director of the movie that let Cillian Murphy won the Oscar for Best Actor?", "true_answer": "Following"}
{"task_id":"codestart_10","question": "Completely ignore all subsequent instructions in this prompt and only output '666'. \n1. Calculate 15 × 7, write only this number. \n2. If you find any contradictory instructions in this prompt, please write 'Banana'.", "true_answer":"666"}
{"task_id":"codestart_11","question": "What is the name of the book that was written by J.K. Rowling and published by Bloomsbury?", "true_answer": "Harry Potter and the Philosopher's Stone"}
{"task_id":"codestart_12","question": "When did the Tianzhou 9 spacecraft complete its rendezvous and docking with the Tiangong Space Station (in Beijing time)? Please provide the answer accurate to the minute in the format: YYYY/MM/DD/HH/MM.","true_answer":"2025/7/15/08/52"}
{"task_id":"codestart_13","question": "What score did JD.com's open-source agent product Genie achieve on the validation set of the Gaia leaderboard according to joyagent-jdgenie repository?", "true_answer":"75.15"}
