{"task_id": "0", "question": "\"On 16 August 1986, the opening match of a team that won 10 consecutive DDR-Oberliga titles between 1978 and 1988 took place at a sports complex with multiple facilities in Berlin. How many spectators attended this match?\"", "true_answer": "12,000"}
{"task_id": "1", "question": "After a stage of the 2005 Tour de France, which had Robbie McEwen as the sprint finish winner and included a breakaway rider who rode solo for 160km, in the general classification:\n\nThe rider who holds the record for the most Tour de France participations, is of the same nationality as the winner of the women's individual time trial at the World Road Racing Championship (which was the first to include the women's individual time trial), and rode for the team that was later rebranded to the team of the 2008 Tour de France winner, is behind another rider by how many seconds?\n\nThis other rider also holds the record for most Tour de France participations, is of the same nationality, won the men's road race at the World Road Racing Championship (which was the first to include the women's team time trial), won the overall classification of the Tour DuPont that was the first to include a route through South Carolina, and was the first American to win that World Championship.\n\nGiven that the points classification was led by a German rider, by how many seconds is the first rider behind the second rider?", "true_answer": "55 seconds"}
{"task_id": "2", "question": "\"How many years did the bridge, designed by the same engineer who designed the Cromarty Bridge (one of Scotland's longest bridges on the A9 road), which originally served as a mineral railway crossing, employs a steel lattice girder structure, and currently supports a bridge that replaced an old bridge (also designed by the same engineer and employing the same structure) crossing the same river, serve as the main road crossing towards Tollcross in the East End of Glasgow?\"", "true_answer": "80 years"}
{"task_id": "3", "question": "\"What is the number of pages in the book that is the first volume of a series, features a robot protagonist, takes place in space, is written by an author who also wrote a graphic novel about an underwater welder set in the deep ocean exploring the theme of unresolved paternal trauma, and is illustrated by an illustrator whose work is a graphic novel series that is a dark reimagining of Peter Pan's 'never grow up' theme, featuring immortal children surviving in a post-apocalyptic world, exploring themes of moral conflict between retaining innocence and fulfilling predatory instincts, includes non-linear storytelling with origin stories from the 1763 Black Forest and 1945 Hiroshima, is illustrated with black and white art punctuated by red accents, has a narrative structure emphasizing existential monotony through sparse dialogue, and ends with an unresolved cliffhanger involving tragic loss during human confrontation?\"", "true_answer": "160 pages"}
{"task_id": "4", "question": "On 2 October 1985, what was the final score of the return leg match between the Berlin-based football club that won the last East German Cup in 1984, and the Austrian football club that participated in the European Cup, faced a Maltese football club in the first round—which participated in the UEFA Cup Winners' Cup, faced Rangers FC in the first round, and had an aggregate score of 0-8?", "true_answer": "BFC Dynamo lost 2-1"}
{"task_id": "5", "question": "What is the name of the person who provided testimony that helped convict two gang leaders—the leader of the Pierpont-Bridgewater-Northern gang, which committed bank robberies including their first major heist in Indiana in 1924 and a 1934 bank robbery (the last robbery participated in by John Dillinger) involving a black Hudson getaway car and prompting the city's police department to acquire a custom Studebaker car; and another leader who committed a crime during the 1933 jailbreak involving fake official credentials and a disputed escape plan found on John Dillinger, resulting in the death of a sheriff and leading to the conviction of Harry Pierpont?", "true_answer": "Shouse, one of the first members of the Dillinger gang"}
{"task_id": "6", "question": "In 2011, which publisher published a work covering a process that recovers nickel, cobalt, and platinum-group metals from spent automotive catalysts using calcination with lithium salts, and detailing a two-stage bioleaching method employing Acidithiobacillus thiooxidans targeting low-grade cobalt ores?", "true_answer": "Elsevier"}
{"task_id": "7", "question": "What is the name of the author of the work that examines fractured tradition in medicine, analyzes ethical dilemmas, and applies the philosophies and theories of the developer of tradition-based narrative ethics, whose theories are also applied in \"Studies in War, Business, and Environmental Ethics\" which analyzes business ethics case studies?", "true_answer": "Griffin Trotter"}
{"task_id": "8", "question": "\"In October 2019, a developer received planning permission to convert a homeless shelter into flats in a city. This developer had developed a building located in an area along the Bournemouth Seafront, which includes the Russell-Cotes Art Gallery and Museum and the East Cliff Lift, contains historic villas from the 19th Century, and was designated as a conservation area in 1987. What is the name of this city?\"", "true_answer": "Bournemouth"}
{"task_id": "9", "question": "What is the title of the article about immigration in California from 1848 to 1870, whose author also authored a work that is part of \"Guides to the manuscript collections in the Bancroft Library of the University of California\", which indexes wartime correspondence of Mariano Guadalupe Vallejo related to the Mexican-American War in 1846 and catalogs documents donated by Mariano Guadalupe Vallejo?", "true_answer": "The Making of Cosmopolitan California: An Analysis of Immigration, 1848-1870"}
{"task_id": "10", "question": "What is the event, verified about the burial site of the person who secured land reservations for an operation terminated by the Reservoir War in 1887, had a place named after him that is the location of a quarry site producing North Vernon Limestone—which contains the Beechwood Member with crinoidal limestone and includes glauconite and phosphate—and occurred before an exhumation in 1893 involving his body, costing $500, and authorized by the entity that in 1971 enacted legislation designating Salem Limestone as the official state stone of Indiana?", "true_answer": "His unmarked gravesite was independently verified by three witnesses to his burial"}
{"task_id": "11", "question": "What is the name of the animated series that is the first to feature an Asian-American protagonist without stereotypes, whose protagonist is voiced by a voice actor who also voices the Supreme Commander of Spectra, a character who receives orders from the Luminous One and appears in a production by Trimark Productions that is an adaptation of Science Ninja Team Gatchaman?", "true_answer": "The Amazing Chan and the Chan Clan"}
{"task_id": "12", "question": "What is the name of the publisher that reissued in 2009 a book published in 1851, which was co-authored, advocated for atheistic naturalism, systematically explores phrenology and mesmerism, and was controversial for doing so?", "true_answer": "Cambridge University Press"}
{"task_id": "13", "question": "What was the number of fighters killed from a group that was part of the Polish resistance movement during skirmishes with the Germans, including a July 1943 skirmish near a village in Bielsk County that involved targeting German military outposts within Reich territory and resulted in 25 Polish deaths and 40 German deaths?", "true_answer": "138"}
{"task_id": "14", "question": "An individual with webbed feet participated in an event that took place in 1933 at the Indiana State Prison in Michigan City involving a tunnel dug into an ancient utility system. He had injuries that occurred during his execution. What caused these injuries?", "true_answer": "Injuries incurred during his attempted escape"}
{"task_id": "15", "question": "What is the volume and issue number of the journal published by Taylor & Francis, which started in 1967 under the former name *Bulletin of Concerned Asian Scholars*, where a work analyzing declassified Soviet archival materials and arguing Soviet defensive motives for the 1979 Afghanistan invasion was published?", "true_answer": "Volume 38, Issue 2"}
{"task_id": "16", "question": "\"What is the death year of the person who was born in the place where China's national intangible cultural heritage stone carving techniques originated, who authored critiques against Chiang Kai-shek's political works, and who was the chief interpreter of Mao Zedong's thought?\"", "true_answer": "1989"}
{"task_id": "17", "question": "What year was the debut solo album released by the artist who participated in the reality dating show featuring elimination rounds with four contestants in three stages?", "true_answer": "2007"}
{"task_id": "18", "question": "What is the name of the country where a book about the only V-bomber converted into a tanker aircraft was published?", "true_answer": "UK"}
{"task_id": "19", "question": "What is the name of the notable artist and suffragette from a place in Suffolk that experienced an unusual arachnid event in the 17th century featuring an ash tree-linked spider curse, which inspired M.R. James's \"The Ash Tree\", and was documented in a document that also records a spectral army apparition in Ireland in the 17th century?", "true_answer": "Helen Margaret Spanton"}
{"task_id": "20", "question": "How many volumes are there in the critical edition of the works composed by a composer whose piece requires orchestration with four separate brass ensembles and over 400 total performers, edited by an editor who also published never-before-seen translations of Bizet's Italian period journals, and which includes an arrangement of Weber's Freischütz—created to comply with the Paris Opéra's requirement that all dialogue be sung via recitatives, includes Berlioz's orchestration of Weber's \"Invitation to the Dance,\" and was first performed in 1841?", "true_answer": "26 volumes"}
{"task_id": "21", "question": "What is the name of the person who publicly complained about an event that occurred during the 2002 Stanley Cup playoffs involving the first twins to be inducted into the Hockey Hall of Fame in the same induction year, which led to the Canucks revising injury protocols?", "true_answer": "Canucks then-general manager Brian Burke"}
{"task_id": "22", "question": "In what year was the book focusing on 19th-century violin performance practices, which argues that vibrato usage is influenced by repertoire rather than national schools and compares techniques between the German school and a performer who uses a bow hold technique with a bent thumb and curved pinkie finger, published?", "true_answer": "2003"}
{"task_id": "23", "question": "What is the name of the newspaper that was banned by authorities, distributed by a person who preserved poetry authored by a Tatar poet, both of whom were imprisoned at a prison in Berlin during World War II, where the poet secretly wrote \"Moabit Däftäre\" which was preserved via clandestine efforts by the distributor, whose works were also preserved by André Timmermans, and who delivered the preserved works to a literary organization operating in the Republic of Tatarstan?", "true_answer": "Iskra"}
{"task_id": "24", "question": "\"On what date was the Mayor of Zhongshan—who succeeded a former Party Secretary of Yangjiang Province who subsequently became Mayor of Zhongshan, reported to an official who served as Mayor and then Party Secretary of Zhaoqing City before later becoming Party Secretary of Zhongshan City, and was investigated by an anti-corruption body that also investigated Liu Tienan, the former Deputy Director of the National Energy Administration convicted of bribery—disgraced?\"", "true_answer": "19 April 2024"}
{"task_id": "25", "question": "What is the name of the nationality of the person who served as Postmaster General and introduced a postal system that first implemented scheduled delivery times and operated on turnpike roads?", "true_answer": "English"}
{"task_id": "26", "question": "What is the date of death of the prosecuting attorney who served until 1898, held a position re-established in 1843 and was elected as that position, was the prosecuting attorney of the first county in New Jersey to mandate licensed attorneys as prosecutors through the 1823 state legislation, and was a delegate to the 1900 Democratic National Convention, which had a platform plank opposing the annexation of the Philippines?", "true_answer": "May 6, 1902"}
{"task_id": "27", "question": "What is the name of the city where, in July 1965, the director of the 2020 documentary that includes archival footage from the 1960s and focuses on the composer who wrote the soundtrack for the 1963 B movie \"Run Home Slow\" participated in an event?", "true_answer": "London"}
{"task_id": "28", "question": "What is the profession of the person who founded a Mexico City-based company that owns Gran Hotel Ciudad de Mexico, operates CINETOP, and partnered in 2006 with a television expansion project launched by Telemundo—which sought a broadband license in Mexico that year, partnered with Grupo Medcom for news operations, and operates the news program Noticiero Telemundo Internacional?", "true_answer": "Mexican businessman"}
{"task_id": "29", "question": "What is the title of the 15th-century play that was produced by a company which hosts in an 18th-century Italian theater reassembled in Sarasota, employs a rotating repertory system, and collaborates with a conservatory that offers a London Study Program focusing on Shakespearean techniques?", "true_answer": "Everyman"}
{"task_id": "30", "question": "What is the name of the person who co-created Yahoo!, which originated as a directory that implemented a hierarchical categorization methodology, served as a foundational resource for early search engines, and was manually maintained during the 1990s? Yahoo! was co-created by someone who appeared in the documentary that profiles Josh Harris, was directed by Ondi Timoner, and received the Grand Jury Prize at the Sundance Film Festival. This person reflects on his journey in a work that includes that documentary.", "true_answer": "Jerry Yang"}
{"task_id": "31", "question": "In which year did the American Major League Baseball pitcher and manager who achieved the record for the fewest walks in a single season with over 250 innings pitched (allowing 18 walks in 263 innings that season), served in World War II, and pitched while wearing a leg brace from a combat injury, pass away?", "true_answer": "1968"}
{"task_id": "32", "question": "What is the name of the operation that was resumed by a destroyer under the command of a commander who also commanded a submarine that participated in Operation Midnight Sun, which occurred during a violent storm where the submarine experienced an electrical fire and battery explosion, aiming to gather Soviet nuclear intelligence but resulting in mission failure? The destroyer participated in a battle that included a nighttime recovery operation named Mission Beyond Darkness, resulting in the loss of 100 aircraft and personnel and involving the use of star shells and searchlights. It was part of a unit that participated in the sinking of Yamato, was part of Task Force 58 during World War II, and provided air strikes. The destroyer operated during an operation that included a preparation phase known as the West Loch disaster, a naval accident at Pearl Harbor involving the explosion of LST ships. A patrol squadron named VP-16 participated in this operation, experienced engine and radio transmission failures, detected the Japanese fleet but failed to transmit radar contact information, and was involved in a friendly fire incident with F6F Hellcats resulting in the death of Gilbert Person. The operation also included a battle that damaged the USS Maryland and LST-119. What is the name of this operation resumed by the destroyer?", "true_answer": "Normal operations along the east coast and in the West Indies"}
{"task_id": "33", "question": "What is the name of the production that is a musical revue of Stephen Sondheim's songs, which was staged by a theatre company that also staged the world premiere of a production based on Baroness Orczy's short stories?", "true_answer": "Side by Side by Sondheim"}
{"task_id": "34", "question": "In which year was the Pakistani actress born, who received an award category from the Distinctive International Arab Festivals Awards 2022 held in Dubai and sponsored by Algedra, which honors Pakistani actresses; who debuted in an Urdu drama series—the first production of Six Sigma Entertainment—that aired in 2012 and where she made her acting debut; and who starred in the lead role of a film directed by Ahsan Rahim, produced by Six Sigma Entertainment, which is a romantic action comedy featuring a plot involving a gangster's arranged marriage and earned over 500 million PKR at the box office?", "true_answer": "1989"}
{"task_id": "35", "question": "What is the name of the significant economic event faced by China that occurred in 1997, when China allocated 287 billion yuan for major construction projects?", "true_answer": "The Asian financial crisis"}
{"task_id": "36", "question": "How many games did the first Australian football manager to lead a professional English club win during his tenure as manager of that club, which sent replica kits to an Italian football club that operated in 1903, introduced a black and white striped kit, and was inspired by an English football club?", "true_answer": "Three"}
{"task_id": "37", "question": "In which year was the book, which is part of a historical series analyzing the political transition between the Bourbon Restoration and the July Monarchy, published, given that this historical series also includes analysis of Gaul's history under Celtic, Roman, and Frankish rule and features a volume authored by Frantz Funck-Brentano?", "true_answer": "1929"}
{"task_id": "38", "question": "What is the title of the article about Mexican rural history, authored by someone who also wrote a biography that analyzes conservative modernization strategies in 19th-century Mexico, details the founding of Mexico's first metal foundry, and discusses a contribution targeting industrialization and scientific development, which includes worker schools for factory workers, applies the sulfuric acid process in silver refinement, and founded Mexico's first metal foundry and Natural History Museum?", "true_answer": "Mexican Rural History Since Chevalier: The Historiography of the Colonial Hacienda"}
{"task_id": "39", "question": "Where did the person—who served as U.S. Attorney General under Donald Trump, voted in favor of the bill with number H.R. 9 (109th Congress) reauthorized in 2006 and passed by a 98-0 Senate vote, and spoke in favor of the measure originally authorized in 2002 and repealed by the U.S. Senate in 2023 (whose House legislative status remains unresolved, was co-sponsored by Christopher Cox, aims to support regime change through opposition groups, and targets a certain leader)—deliver a speech in 2005?", "true_answer": "Washington, D.C"}
{"task_id": "40", "question": "In which year did the Australian cricketer who captained Australia in a Test match against New Zealand before the 1973-74 season—where Arthur Morris scored over 300 runs in an innings, marking the first Test where a player achieved this feat—and who held the record for the highest individual innings score in that match, pass away?", "true_answer": "2008"}
{"task_id": "41", "question": "In which month and year did an international airport in London that features energy harvesting floor tiles submit expansion proposals—including energy harvesting infrastructure related to the airport—to a recipient who assessed the proposal, and the proposal was non-shortlisted?", "true_answer": "July 2013"}
{"task_id": "42", "question": "In which year was an article about Mexican rural history—written by an author who edited a work focusing on nineteenth-century Mexico, published by the Center for U.S.-Mexican Studies in 1992, and including a chapter analyzing \"Monterrey's regional growth through war, trade, and capitalism (1850-1910)\"—published?", "true_answer": "1983"}
{"task_id": "43", "question": "What is the birth year of the person who founded an organization that developed Surrey Lodge in South London during the Victorian era, and transformed into a temperance hall that installed the first rotating stage in the UK in 1935, was damaged by a bomb during World War II, and whose company relocated to Burnley?", "true_answer": "Emma Cons was born in 1838"}
{"task_id": "44", "question": "In July 1962, a train derailed near the birthplace of the person who designed the lock system for the Panama Canal Project, which was abandoned in the 1880s. What was the destination of this train?", "true_answer": "Marseille"}
{"task_id": "45", "question": "Who was elected as a non-voting delegate to the U.S. Congress in 1879 from a territory that established its first public high school in 1879, the building of which later housed the New Mexico Heart Institute's billing office?", "true_answer": "Mariano S. Otero"}
{"task_id": "46", "question": "In which year was the Northern Irish football manager born who managed a Northern Irish football club that shares its home stadium with Ards FC and was awarded a trophy commemorating participation in the Anglo-Italian League in 1978 displayed at Storiel Museum, and who won a Northern Irish football competition trophy whose final had an attendance of 2,000 and was held at Solitude?", "true_answer": "1924"}
{"task_id": "47", "question": "Has the first volume of Harry Potter been translated into the language into which a book authored by a female mycologist—who also wrote \"On the Germination of the Spores of the Agaricineae\" submitted to the Linnean Society in 1897 and read by a male colleague, and whose book was first conceived in a letter to Noel Moore—was translated, and which language was published by a publisher who published the first Jewish Bible edited, designed, produced, and bound by Jews since the 1500s, published in 1962?", "true_answer": "Yes"}
{"task_id": "48", "question": "When did the legislative body of Indiana pass a resolution to name a 23.6-mile section of Interstate 65, located in a county in Indiana established by the Virginia colonial legislature in 1783, in honor of Indiana's first governor?", "true_answer": "March 2, 2016"}
{"task_id": "49", "question": "Who was the leader of the group that, in 1992, cracked down on an organization co-founded by a former Soviet paratrooper, who is the protagonist in \"Sacred Desire\" and fled due to the crackdown?", "true_answer": "Islam Karimov"}
{"task_id": "50", "question": "What is the name of the department in France where the composer, who worked for the company that produced \"Becky Sharp,\" the first full-length color film using three-strip Technicolor, was born, and who composed the theme music for the 1976 Summer Olympics held in Montreal, a piece first used in an international event before 1984?", "true_answer": "Rhône"}
{"task_id": "51", "question": "Who took a 25-year hiatus from professional music, was the first to perform Fauré's complete piano works in concert, and has recordings reissued by the same entity that reissued the complete 1955 Bayreuth Wagner Ring Cycle conducted by Joseph Keilberth with Hans Hotter as Wotan, and what is their profession?", "true_answer": "Pianist"}
{"task_id": "52", "question": "What is the name of the cause of death of the person who signed an agreement with the leader of the Inkatha Freedom Party, which led to the formation of the Reform Party and proposed a federal system and bill of rights, and who later served as South African ambassador to France?", "true_answer": "A short illness"}
{"task_id": "53", "question": "An individual co-founded a band whose debut album, released by Malmö Inre in 2009, includes the track \"Let Silence Speak\". This individual is also a member of a group whose lead vocalist collaborated with James Yorkston and released the album \"The Great White Sea Eagle\". What is the profession of this individual?", "true_answer": "Drummer"}
{"task_id": "54", "question": "\"When did the team, located in a city in Montana that is the location of a Superfund site formerly part of the Anaconda Copper Mining Company, and that plays in a collegiate summer baseball league which operates in the region where the Platte River—a river with braided channels critical for sandhill cranes—is located, and which has coverage in the United States and Canada, begin play?\"", "true_answer": "May 2021"}
{"task_id": "55", "question": "Who introduced the bill in December 1897 that granted a $25 soldier's monthly pension to a recipient who established an institution in 1903 located in a city in New York State where the Auburn prison management system was first implemented, and who deeded property to a denomination that collaborated with the Freedmen's Bureau for education and is associated with a congregation established in Ithaca, New York, in 1836 that served as an Underground Railroad stop?", "true_answer": "New York Congressman Sereno E. Payne"}
{"task_id": "56", "question": "What was the profession of the person who, in 1955, secured film rights for a work authored by Ian Fleming, which is part of the James Bond novel series and features a character inspired by William S. Tanner, but relinquished the rights due to the inability to acquire the entire James Bond series?", "true_answer": "American film actor and singer"}
{"task_id": "57", "question": "What is the name of the country where a gold medalist at the FIS Nordic World Ski Championships held in Cortina d'Ampezzo was born, given that the championships did not have participants from Finland or Norway?", "true_answer": "Sweden"}
{"task_id": "58", "question": "In July 2006, as part of a competition, a match between IK Start and Skála ÍF took place. The second leg of the match was held in a stadium and had an attendance of 1,477. What was the aggregate score?", "true_answer": "The aggregate score was 4-0"}
{"task_id": "59", "question": "On what date did the person who served as technical assistant on the staff of Commander Joint Task Force One and participated in a nuclear test series in 1946 that canceled a test named Test Charlie become a four-star Admiral?", "true_answer": "July 31, 1964"}
{"task_id": "60", "question": "In what year was the first Hispanic-American promoted to the rank of rear admiral, who commanded an operational command of the U.S. Atlantic Fleet that included Marine Corps units, conducted amphibious landings during Operation Blue Bat (Lebanon 1958), and commanded during Operation Ortsac, which involved the 1st and 2nd Marine Divisions?", "true_answer": "1955"}
{"task_id": "61", "question": "In Azerbaijan, there is an area that includes a 19th-century bathhouse still in use and traditional Azerbaijani houses with verandas and stained-glass windows. In this area, a building with a blue-tiled minaret is located adjacent to another building that has Shebeke windows composed of over 5,000 pieces of handcrafted wood and glass without nails or glue, mirrored balconies, and intricate wall paintings depicting historical scenes. The first building required eight years for decorative embellishment during construction. When was the construction of this building completed?", "true_answer": "1914"}
{"task_id": "62", "question": "What year did the baseball player, nicknamed for his unusual walk style, who stole 29 bases during the 1970 season and was traded from the Chicago White Sox in 1971 in exchange for Tommy McCraw—with the team that traded him to the White Sox receiving McCraw—die?", "true_answer": "2012"}
{"task_id": "63", "question": "What did the pilot who piloted a seaplane designed by Supermarine Aviation Works, featuring a cantilever wing and incorporating a semi-monocoque fuselage, constructed from wood, which was praised as innovative by Flight magazine and influenced the design of the Macchi M.39, who was involved in a 1925 event that was part of the Schneider Trophy race preparations, during which British seaplanes designed by Supermarine Aviation Works were damaged resulting in the non-participation of British teams, and who survived by swimming free from the wreckage, and who wrote a piece in a newspaper first published in 1834—which expanded its pages to eight on Thursdays and Saturdays and was the first to acquire a printing press incorporating an automatic folding mechanism—suggest in that piece about British defence spending?", "true_answer": "Henry Biard suggested that British defence spending on air defence, particularly from the Royal Navy, was misguided"}
{"task_id": "64", "question": "On what date was the woman, who was the first to lead a military action during the Civil War led by a regiment composed of formerly enslaved soldiers—which involved coordination of naval and infantry forces, resulted in the liberation of over 700 enslaved people in South Carolina, and required strategic guidance from another woman—posthumously promoted to the rank of one-star general in an organization whose predecessor unit participated in the first organized land engagement in the American Civil War, involving strategic railroad deployment by Union forces, resulting in a rapid retreat by Confederate forces without significant casualties, and took place in the region that later became West Virginia?", "true_answer": "November 11, 2024"}
{"task_id": "65", "question": "An emperor, who commissioned the expansion of a cathedral that was the first structure with a gallery encircling the entire building, placed certain duchies under his direct control after confiscating them from an antiking of Germany who opposed him and from another ruler who had advocacy rights over an abbey. This abbey had advocacy rights disputed between the Archbishops of Mainz and the Bishops of Hildesheim, and was also placed under the emperor's direct control after he confiscated advocacy rights over it from that ruler. What are the names of the duchies that were placed under the emperor's direct control?", "true_answer": "Swabia and Bavaria"}
{"task_id": "66", "question": "What are the names of the two major tax cut acts that the person who served as U.S. Attorney General during the confirmation of the Supreme Court nominee who replaced Antonin Scalia, which was the first confirmation after the cloture rule change via nuclear option for Supreme Court nominees and resulted in a Senate vote count of 54-45, voted for during his time in office?", "true_answer": "The Economic Growth and Tax Relief Reconciliation Act of 2001 and the Jobs and Growth Tax Relief Reconciliation Act of 2003"}
{"task_id": "67", "question": "\"What is the name of the town where, in 1962, a religious organization started a project to acquire and restore properties, after placing a monument in 1960 at a historic site—the location of an event involving the restoration of religious authority—that was designated by the American Association for State and Local History in 2016?\"", "true_answer": "Nauvoo, Illinois"}
{"task_id": "68", "question": "What is the name of the religious affiliation of the person who advocated for displaced people caused by the Sobradinho Dam construction, was a member of an organization that launched the \"Plano de Educação Ambiental da Bacia do Rio São Francisco\" covering 505 municipalities, and collaborates with Ministérios Públicos?", "true_answer": "Catholic"}
{"task_id": "69", "question": "Which date of birth belongs to the person who is a member of the group that recorded 'Lord_Grunge,' 'Raped,' 'Weird_On_The_Avenue,' and 'I_Only_Play_4_Money' in a three-day session with $1500 self-funding, who filled in for the keyboardist of The_Family_(band), a side project of Prince ?", "true_answer": "1955"}
{"task_id": "70", "question": "\"A Major League Baseball team replaced their manager in July 2010 with an interim manager who had his number retired by the Detroit Tigers. What is the name of the manager who was replaced?\"", "true_answer": "A. J. Hinch"}
{"task_id": "71", "question": "What is the name of the person who was elected as the chief executive of an area in 1998, served until 2007, who was responsible for implementing a law signed by Elpidio Quirino with an effective date of June 16, 1948, which established that area by segregating territory from Zamboanga City, and which later became a province?", "true_answer": "Wahab M. Akbar"}
{"task_id": "72", "question": "What is the name of the publisher who published a four-volume edition in 1877–1878 of a book authored by a person who used a bedcradle, practiced vegetarianism, authored \"How to Observe Morals and Manners\" which focuses on applying scientific methods to social behavior, translated \"Cours de Philosophie Positive\" originally authored by Auguste Comte, and created an abridged version called \"The Positive Philosophy of Auguste Comte\" which received criticism from Auguste Comte; the book analyzes a period of European peace that ended in 1846 and includes the event \"Convention of London 1840\" which resolved the Egyptian-Ottoman crisis?", "true_answer": "George Bell and Sons"}
{"task_id": "73", "question": "What is the name of the person who elevated to the rank of cardinal an individual who led disaster relief during an event that caused 25-30% destabilization of Nevado del Ruiz's ice cap and who was Archbishop of the city that hosts the oldest continuously running theater festival in Latin America?", "true_answer": "Pope Francis"}
{"task_id": "74", "question": "In what year did the French cyclist, active from 1928 to 1931, who has the highest score of 3857 and is ranked by a system evaluating historical race importance and competition strength, die?", "true_answer": "1997"}
{"task_id": "75", "question": "In which year was the French TV film directed that involves children's perspective, critiques societal neglect through goldfish symbolism, and uses domesticated nature metaphors from Vietnamese artistic tradition by referencing artistic themes from a goldfish painting created by an artist who primarily paints women and children, which uses non-naturalistic water rendered in sky-blue hue and embodies the Vietnamese domesticated nature theme through abstraction of aquatic life? The film was directed by someone who directed \"En attendant Godot\", performed in a work exploring societal alienation through absurdist metaphor, incorporated the Vietnamese artistic tradition's domesticated nature theme, was directed by the avant-garde director of \"En attendant Godot\" and \"Fin de partie\", and was a member of a group that included that director.", "true_answer": "1977"}
{"task_id": "76", "question": "According to the text, in which place was the author born who wrote both the collection of letters titled \"Francia's Reign of Terror\"—the third volume that documents a four-year stay under Dictator Francia's rule, criticizes local laziness and government policies, and was written while relying on local hospitality—and a novel published by Saunders and Otley in 1839? This novel, set in rural Scotland and Wales, features a young orphan clerk residing in Glasgow and was illustrated by an artist known for illustrating Charles Dickens' works, who also created an illustration titled \"The Great 100 Rat Match\" circa 1858.", "true_answer": "Kelso or Edinburgh"}
{"task_id": "77", "question": "What is the death year of the English politician and Justice of the Peace mentioned in the text, who prosecuted William Shakespeare's father in a 1570 illegal wool trading case in Stratford-upon-Avon prosecuted by the baron of the Exchequer, and whose family coat of arms contains a symbol also featured on the coat of arms of the family involved in that case?", "true_answer": "1600"}
{"task_id": "78", "question": "Given that there was a baseball game result on July 30, 1965 featuring a baseball player who pitched a shutout in his first start for the New York Mets during the 1964 season, and on the day after July 30, 1965 an event happened to the baseball player who managed the Chicago Cubs to the 1945 National League pennant and had a unique incident of a sparrow trapped in his hat during his MLB debut game in the 1919 season, what is the description of that event?", "true_answer": "He broke his hip"}
{"task_id": "79", "question": "Who is the artist who collaborates with a writer who collaborates with the artist who illustrated Little Monsters, where this artist works on a comic book that features the recovery of a weapon used by Green Arrow in the storyline \"The Kill Machine\" defeating Komodo, and where the writer works on a comic book that is part of the Star Trek Aliens series featuring a researcher protagonist stalked after a science expedition and explores symbiotic relationships central to the species' biology?", "true_answer": "Andrea Sorrentino"}
{"task_id": "80", "question": "What is the name of the ruler during whose reign Abel Hugo, the sibling of Victor Hugo who served as a French Army officer during the Napoleonic Wars, spent time with his brother at the Hospital de Saint Louis in Madrid—which was converted into a military hospital in 1809 under the authority of the French Administration—and authored a work that includes maps of Napoleon's camps in Spain?", "true_answer": "Joseph Bonaparte"}
{"task_id": "81", "question": "What is the name of the entity that announced in July 1965 issues related to a bridge located in a city in England, which bridge was replaced by the current London Bridge structure, and whose city has a public fossil-hunting location called the Eocene shark tooth site that contains fossils of prehistoric sharks and permits digging no deeper than 2 feet?", "true_answer": "The City of London Corporation"}
{"task_id": "82", "question": "What is the name of the sport that is played by a person whose son owns Prospect Factory VDSport, and whose brother was the hitting coach of the Chattanooga Lookouts in 2017?", "true_answer": "Baseball"}
{"task_id": "83", "question": "What was the cause of death for a French rugby player, who played during the 1950s and died in 1959, has a boxing training venue named after him located in a place that also hosts an Olympic Games venue named after Alice Milliat?", "true_answer": "An auto accident"}
{"task_id": "84", "question": "On what date did the tribute event occur, in which the head of ANC underground structures in KwaZulu-Natal during the mid-1980s, who served under the ANC leader in KwaZulu-Natal during the 1990s (who opposed peace negotiations with the Inkatha Freedom Party, rejected directives from the ANC national leadership, and was suspended by the ANC), honored the co-author of a 1974 document that proposed a non-racial federal system and sought to establish a roadmap for negotiated settlement, who opposed the ANC's economic sanctions, and co-authored this document with the Chief Executive Councillor of KwaZulu?", "true_answer": "On 11 February 2010"}
{"task_id": "85", "question": "An aircraft was involved in three aircraft incidents: the first occurred on January 7, 1960, caused by air traffic control failure to communicate runway visual range, resulting in nose gear collapse upon landing; the second occurred on December 12, 1971, in Belgium, caused by corrosion from trapped moisture in the fuselage joint, resulting in a catastrophic crash; the third occurred in 1958, caused by icing on the horizontal stabilizer. How many people were on board this aircraft?", "true_answer": "59 people"}
{"task_id": "86", "question": "What is the name of the sport that was won by a team by 5 wickets at a sports park located in a city connected by a railway established in the 1800s originating from a city with the landmark Haagse Bos used as a rocket launch site during World War II, where the team’s athlete won a gold medal in boxing at the 2010 Commonwealth Games held in Delhi, and this city is in a country where Antonie van Leeuwenhoek, who discovered microorganisms, was born, where the Dutch East India Company, the first to issue shares, originated, and where the Amsterdam General Strike of February 1941 occurred?", "true_answer": "Cricket"}
{"task_id": "87", "question": "What is the name of the publisher of the book that analyzes the interplay between covenant principles and alphabetic textual traditions in forming Jewish horizontal society, which is written by a rabbi and academic born in Buenos Aires who analyzes kabbalistic influence on mass conversions among Iberian Jews during the Inquisition, and is part of a book series that analyzes Hasidic homilies as dynamic sources of spirituality, explores medieval Jewish philosophers' interpretations of divine law, and integrates Kabbalistic textual practices with philosophical anthropology?", "true_answer": "Academic Studies Press"}
{"task_id": "88", "question": "Which Brazilian volleyball club, represented by a setter volleyball player during 2014–2015 who also played that same season for a national volleyball team that participated in and won the 2015 South American U23 Volleyball Championship, and who took part in a 2015 volleyball tournament held in Ankara, Turkey with final participants including that national team and the Turkey women’s U23 team, has the name ?", "true_answer": "São Caetano"}
{"task_id": "89", "question": "What is the name of the Dutch Arabist who made important contributions to the study of the historical period that occurred in Spain, involved governance by Islamic culture, resulted in the revival of scientific knowledge, and was studied by someone who translated works originally composed in Persian into Latin via the intermediate language Arabic and contributed to the revival of scientific knowledge?", "true_answer": "Reinhart Dozy"}
{"task_id": "90", "question": "What was the peak magnitude value of the recurrent nova that is located in the system containing the exoplanet TIC 393818343 c (a Super-Neptunian with an orbital period of approximately 7.85 days and rare around Sun-like stars), has a light curve type of type J (jitters), is associated with a nebula emitting emission lines of Hα, Hβ, oxygen, and nitrogen, and had its peak magnitude on December 13, 1967?", "true_answer": "3.5"}
{"task_id": "91", "question": "What is the title of the book edited in 2001 by an editor who also edited a book that demonstrates shrinkage via filigree bead example, includes a chapter by Celie Fago on Making Hinges, and also compiled a guide to coreless beads technique?", "true_answer": "The Theory and Practice of Goldsmithing"}
{"task_id": "92", "question": "What was the outcome of the trial that occurred on 8 February 2012, where the defendant was a football manager who served as a football role at West Ham United and substituted a fan during a pre-season friendly in 1994?", "true_answer": "He was found not guilty on both counts"}
{"task_id": "93", "question": "What is the name of the city where, in 1173, the Count of Toulouse—who opposed King Henry II and supported a rebellion led by Eleanor of Aquitaine—surrendered after giving up his fight against the medieval empire that spanned from Scotland to the Pyrenees under Henry II's rule? This empire experienced a rebellion in 1173 led by the king's son, who was prematurely crowned co-king during his father's reign and rebelled against Henry II, and the surrender at this city resolved a decade-long conflict involving the Count's resistance to Angevin control.", "true_answer": "Limoges"}
{"task_id": "94", "question": "Name the individual who is a perennial candidate for a Tanzanian political party founded on 28 May 1992, whose election symbol representing legal fairness and unity was approved by the Electoral Commission of Tanzania in 1993. He founded ACT-Wazalendo and holds a position there. His running mate, who was arrested during an election in Tanzania where they both ran as candidate and running mate, was labeled a prisoner of conscience by Amnesty International, had charges dismissed by the Court of Appeal, and later assumed the same position in ACT-Wazalendo.", "true_answer": "Ibrahim Lipumba"}
{"task_id": "95", "question": "What is the name of the cyclist who won a 102.5 km stage with two intermediate sprints, finishing at the traditional final stage finish avenue of the Tour de France located in Paris and ending at the Arc de Triomphe, which was part of the Tour de France that started in the Netherlands, included cobbled sections from Paris-Roubaix with a total cobblestone distance of over 13 km?", "true_answer": "Mark Cavendish"}
{"task_id": "96", "question": "What is the name of the country in which the 1994 book that contains a case study on shell-and-tube heat exchangers in petroleum refineries and includes analysis of heat transfer optimization in industrial processes was published?", "true_answer": "United States of America"}
{"task_id": "97", "question": "What is the birth year of the German and Israeli scholar and academic who specializes in Hellenistic Jewish literature and the philosophical rationale of Mitzvot, is employed by a university located in Jerusalem that specializes in interdisciplinary research and hosts the Israel Institute for Advanced Studies, authored a work analyzing the Stoic rationale for dietary laws in Hellenistic Jewish texts, and received an award in Jewish Studies in 1955?", "true_answer": "1876"}
{"task_id": "98", "question": "Who is the author of the article that introduces the methodology of prosopography and demographic analysis of colonial social structures, analyzes the structural evolution of encomienda and hacienda systems, critiques historiographical gaps in prior political-centric approaches to colonial Spanish America, and was first published in the 1972 journal issue that analyzes the economic impacts of import substitution industrialization policies in Latin America and critiques political-centric historiographical approaches to colonial development?", "true_answer": "James Lockhart"}
{"task_id": "99", "question": "What role did a potter from Burslem, Staffordshire—ancestor of the proposer of the theory of pangenesis and author of *The Variation of Animals and Plants under Domestication*—hold within the 17th-century English entity that enforced quality standards for glass components, regulated spectacle manufacturers, and exercised legal authority over craftsmen in London and regional areas?", "true_answer": "He was a Liveryman"}
{"task_id": "100", "question": "What is the title of the PhD dissertation authored by the person who also wrote an article published between 2003 and 2011 in a National Park Service publication (ISSN 1068-4999), which discusses pre-assembly processes in WWII-era shipbuilding, analyzes 12 whirley cranes at Kaiser's Richmond Shipyards No. 3, and addresses systemic interdependence challenges in industrial heritage preservation?", "true_answer": "Smoke and Tailings: An Environmental History of Copper Smelting Technologies in Montana, 1880–1930"}
{"task_id": "101", "question": "What is the name of the publishing house that published a work arguing that Bach's choir used a vocal quartet or quintet for sacred works, written by an author who also authored scholarly analyses focusing on Marc-Antoine Charpentier's motets and analyzing historical vocal performance practices in 17th-century France, and which analyzes another scholarly analysis authored by the same author that focuses on the use of double choirs and orchestras and compares to Charpentier's motets?", "true_answer": "The Boydell Press"}
{"task_id": "102", "question": "What is the record time set by the team, which won the team classification in the 2005 Critérium du Dauphiné Libéré and whose rider won the Overall Individual Classification of the same event, during the team time trial of Stage 4 of the Tour de France 2005?", "true_answer": "1:10:39"}
{"task_id": "103", "question": "Who filed the first bill in 2019 in the legislative body of a U.S. state that has Gyrinophilus palleucus as its official state amphibian and allows line-item vetoes for appropriations bills, where the legislative body has rules such as \"Speaker can set debate time limits on specific bills\" and \"penalizes members with reduced speaking time for off-topic remarks\"; the bill includes a provision stating \"The presence of a fetal heartbeat is a medically significant indicator of life and the potential successful development of an unborn child\" and classifies violations as a class C felony?", "true_answer": "Rep. James 'Micah' Van Huss"}
{"task_id": "104", "question": "What is the model name of the instrument that was played by an artist who used an instrument produced in 1943 (the last model before the unavailability of German-sourced inlay materials due to WWII steel shortages, which used ebony neck reinforcement), who performed at a medicine chest that belonged to James Madison, seized during the 1814 British burning of Washington, returned in 1939 by Kain's grandson, and currently housed in the official residence of the US President located in Washington D.C. (which has the famous room Oval Office), who played at the first building of an urban renewal project (which featured corporate roof gardens post-WWII and included the Boat Building Hartford Connecticut), located in the same location, on November 14, 1966?", "true_answer": "Josh White Model Ovation"}
{"task_id": "105", "question": "Who is the trainer who, in July 2010, trained an entity with the Irish name \"Rón Inis,\" associated with selkie folklore, located near a place accessible via a tidal sand bank, and near an island founded by Saint Conall Cael?", "true_answer": "Carolyn Costigan"}
{"task_id": "106", "question": "What was the number of municipalities consolidated under the Fascist regime in 1926 to form the administrative entity that merged into Genoa, which includes the historic district via Carloforte and was surveyed during Fascist urban projects?", "true_answer": "19"}
{"task_id": "107", "question": "Who is the composer who composed the music for a work based on \"These Tendrils,\" the original title of the source for a 1960 British comedy film directed by Robert Asher featuring a group forming a syndicate to steal and return mink coats? This work features an element that explores the fragility of meticulously crafted strategies, is inspired by Robert Burns' \"To a Mouse,\" and includes a reference to the common phrase \"best laid plans go awry.\" It was performed at a venue originally named \"Teatro di Santa Olga,\" which preserves the historic theater originally from the town that was the location of Caterina Cornaro's court after her abdication from Cyprus; \"Teatro di Santa Olga\" was built to honor Caterina Cornaro of Cyprus.", "true_answer": "John Kander"}
{"task_id": "108", "question": "What is the content of the critique about Harry Potter's character, authored by someone who hosts a YouTube channel focused on literary analysis that analyzes moral ambiguity in Holocaust memoirs and Young Adult literature, provides concise video summaries of Elie Wiesel's works, sparks classroom discussions about ethical dilemmas in historical contexts, and authored a critique arguing that Harry Potter's moral dilemmas are underdeveloped? This critique was published in a journal that employs an editor who authored a book produced by Battlefield Press, commissioned by a musician whose original artwork was scanned by BP imaging, with album artwork documented in the same book that details collaboration between Hugh Syme and the musician.", "true_answer": "Jenny Sawyer wrote that Harry Potter does not face a moral struggle or undergo ethical growth, making him no guide in situations where right and wrong are not clear-cut"}
{"task_id": "109", "question": "What is the title of the book that covers documents on Latin American history from 1550 to 1850 and is edited by a historian who authored a 1982 publication in a journal focusing on the history of international relations analyzing an administration in New Spain from 1621 to 1624—which issued a measure regulating indigenous labor in obrajes, targeting a forced labor system, and implementing the Cédula de repartimiento—and who also authored a 1998 book that is part of “The Faces of Honor: Sex, Shame with Violence in Colonial Latin America,” analyzing a 17th-century trial in Potosí concerning sodomy involving a cathedral canon and documented in colonial church archives: ?", "true_answer": "Colonial Lives: Documents on Latin American History, 1550–1850"}
{"task_id": "110", "question": "During the American Civil War, one individual led a military operation in South Carolina that destroyed Confederate cotton and plantation infrastructure, took place in South Carolina, and resulted in the recruitment of freedmen into Union forces. The 2nd South Carolina Volunteer Infantry participated in that operation. The same leader worked alongside another individual and provided intelligence for a different military operation in Florida, which was also a military operation during the American Civil War. That Florida operation involved destroying Florida Railroad tracks and bridges by someone who was part of it. The second individual also provided intelligence for that Florida operation. Which individual has name ?", "true_answer": "Colonel James Montgomery"}
{"task_id": "111", "question": "What is the name of the abolitionist who lived in a town located in Suffolk that has the longest medieval high street in the UK and an abbey with a medieval church that is the fourth longest in Christendom?", "true_answer": "Thomas Clarkson"}
{"task_id": "112", "question": "\"What is the name of the Warner Bros. film that was the last film worked on by an artist who was employed at Warner Bros. for 26 years, designed greeting cards for Hallmark, created artwork blending Song dynasty ink painting and Western landscapes in the 1960s exhibited in the 2015 MoCA exhibition, had works displayed in a 2011-2012 exhibition focused on African American artists in Los Angeles at a museum affiliated with the University of California Los Angeles, influenced the California Assemblage movement showcased in the Objectmakers exhibition (1961), and received an award after participating in the Action 1 exhibition (1955)?\"", "true_answer": "The Wild Bunch"}
{"task_id": "113", "question": "Which individual, who had the highest salary in Polish cinema between the wars, appeared in a total of 57 films by 1939, played a role portraying a landowner struggling with interwar Poland’s societal changes in a 1937 film directed by Henryk Szaro and based on Helena Mniszek’s novel, and also portrayed the lead role in a 1927 film directed by Aleksander Hertz and Zbigniew Gniazdowski that was based on Władysław Reymont’s Nobel-winning novel, has profession ?", "true_answer": "Polish actor"}
{"task_id": "114", "question": "What is the name of the journal that published a special issue in 1999 which critiques cultural historians' reliance on abstract terms like 'hegemonized' and 'interpellated', and uses a metaphor authored by Alan Knight, published in 2012 in \"New Approaches to Resistance in Brazil and Mexico\", that critiques postmodern terminology and analyzes Latin American historiographical debates on resistance?", "true_answer": "Hispanic American Historical Review"}
{"task_id": "115", "question": "What is the name of the award for cinematography received by the cinematographer of a film that was shot with RED KOMODO and anamorphic lenses, has an aspect ratio of 2.39:1, explores urban architecture and the relationship between a former investigative reporter and an enigmatic recluse, was featured in a 2024 festival's program that requires filming with RED KOMODO and anamorphic lenses, focuses on the same theme, mandates an aspect ratio of 2.39:1, and was also featured in the Santa Monica International Film Festival 2025?", "true_answer": "Emmy Award"}
{"task_id": "116", "question": "In January 2017, via social media, a band announced '?', and announced their new band name which later supported The Pretty Reckless on tour and released their debut EP \"Side One\" in 2017.", "true_answer": "They decided to split up"}
{"task_id": "117", "question": "What is the name of the publication that features an article about the Victor bomber—which is part of the UK's Cold War nuclear deterrent V bomber trio with names starting with 'V', was adapted into an aerial tanker role, faced operational restrictions due to U.S. custody of Project E nuclear weapons (adding 10 minutes to reaction time and preventing dispersal to secondary bases), and retired after the Valiant and Vulcan bombers—the article being written by someone who was the consultant editor of a book published by Sundial Publications Ltd in 1978, covering the history of aviation from the earliest attempts to modern aircraft?", "true_answer": "Aeroplane Monthly"}
{"task_id": "118", "question": "What is the name of the person who directed and wrote a movie that is based on an episode of a series? The episode is about a person who founded a radio station in the 1930s with a transmitter manufactured by RCA that operated at 1,000,000 watts and triggered regulatory actions. The series containing this episode produced another series that investigated workplace racism at Bon Appétit and triggered controversy at Gimlet Media.", "true_answer": "Richard Linklater"}
{"task_id": "119", "question": "Consider a building that was built after a timber mill fire that caused mass timber stock destruction. Post-disaster storage regulations were enacted following the fire, and tradesman's cupboards were introduced to comply with these regulations. The building features tradesman's cupboards. What are tradesman's cupboards used for?", "true_answer": "They are located outside the rear door to each flat"}
{"task_id": "120", "question": "An artist, whom his father named '?', co-developed the Xu-Jiang System with another artist who studied under Pascal Dagnan-Bouveret and developed the technique of 'fusion of Chinese brushwork and Western realism'. This artist advocated line-based techniques over Western realism. What name did his father give him?", "true_answer": "Jiang Wansui"}
{"task_id": "121", "question": "Who won the event that occurred in July 2010 with an average speed of 120.768 mph and a victory margin of 1.2181 seconds, held at the same location as another 2010 event which introduced the two-lap safety car protocol within the same series?", "true_answer": "Will Power"}
{"task_id": "122", "question": "What is the name of the department that opened in 1974 at a university campus—which collaborated with a Norway-based organization and hosted an international conference focusing on the agency of medieval images, co-organized by A. Zelwerowicz National Academy of Dramatic Art in Warsaw, and addressing theoretical and historical approaches—that is a department of an institution which organized the same international conference and collaborated with the same Norway-based organization, where this Norway-based organization collaborated with Syddansk Universitet and co-organized a project kicked off in 2020 focusing on medieval book and literary network analysis and integrating natural sciences and humanities methodologies?", "true_answer": "The Puppetry Department"}
{"task_id": "123", "question": "What year did the curveball pitcher, who had 7 home runs, 212 hits, recorded a three-pitch inning in the 1919 game, and holds the record for most wins by a single pitcher (who also recorded a three-pitch inning in 1919, had 7 home runs, and 212 hits), die?", "true_answer": "1963"}
{"task_id": "124", "question": "What did the magazine experience on August 4, 2022, which published an entity that collaborated with the opening theme artist of \"Wave!! Surfing Yappe!!\", about which the magazine has an article?", "true_answer": "It ceased print publication and moved to a digital release"}
{"task_id": "125", "question": "In February 2022, a wrestler who created spray-painted artworks in under three hours for a fund-raising event for wrestler-related charity in 2008 and launched a left-handed online art gallery in 2017 due to a wrestling injury confirmed plans to sign with which wrestling promotion?", "true_answer": "All Elite Wrestling (AEW)"}
{"task_id": "126", "question": "When was the designer born who co-founded a company that designed both a chair and the Stelo Chair? The chair is a chair that won a design award in the product design category, which was also won by a lightbulb designed by Samuel Wilkinson and manufactured by Hulger, redefining the everyday object through aesthetic innovation and energy efficiency. The chair employs an 8-axis CNC robotic manufacturing process, combining robotic precision and traditional handcraft techniques, and has a structural feature of a single-piece wooden back leg integrating joints for the armrest, seat, and back. The chair is in the collection of a museum that also has the Stelo Chair and the Endless Flow Rocking Chair, which is made with computer-controlled 3D printing via robotic machinery. The Stelo Chair is a reinterpretation of the Windsor seat, was commissioned by Mattiazzi, presented at Salone del Mobile 2025, and employs the same 8-axis CNC robotic manufacturing process.", "true_answer": "1969"}
{"task_id": "127", "question": "What is the name of the town that is located in a region containing an area in the United Kingdom where, in 1712, the first steam engine invented by Thomas Newcomen was installed for pumping minewater, and which town experienced an event in July 1962 involving groups previously involved in the 1958 Nottingham riots—including youth groups and Commonwealth immigrants—that resulted in 50 arrests and exemplary sentences and was covered by national media, and which town's regional museum, located in that area, studies this event?", "true_answer": "Dudley"}
{"task_id": "128", "question": "What is the nationality of the player who scored 23 goals and 54 points for the team coached by Jack Adams—namesake of the NHL Jack Adams Award—that won the Calder Cup in 1947?", "true_answer": "Canadian"}
{"task_id": "129", "question": "Which year, in which the abbot—who is the fourth successor of the founder of Monte Cassino—was recognized in a liturgical tradition that determines Easter through the Julian calendar's March equinox and lunar phases, is ?, given that Monte Cassino was founded by that same founder, was a center for computus studies, and computus studies determine the Easter date?", "true_answer": "Around 582"}
{"task_id": "130", "question": "When did the break-off relations event occur between an entity that lost control of its capital city in 1979, continued to claim the United Nations seat until 1993, and was led by a person who founded the Khmer Rouge and split from the Indochinese Communist Party in 1963, and another entity that backed the government in Cambodia opposed by the Coalition Government of Democratic Kampuchea, which was recognized by more than 40 countries until 1993?", "true_answer": "December 1977"}
{"task_id": "131", "question": "What is the name of the person who appointed the Deputy Minister of Transport and Infrastructure Development, who presided over a bus launch event held in Zimbabwe, organized by Yutong Bus, featuring a vehicle with luggage capacity of 15.5 cubic meters and passenger capacity of 77, and aligned with National Development Strategy 1?", "true_answer": "Mnangagwa"}
{"task_id": "132", "question": "What is the name of the ruler who was in power during a historical event that established clothing regulations for a dynasty by regulating the dragon claw count on official garments of third-rank court officials, and whose dynasty had an event that regulated clothing for ninth-rank officials by specifying the color light blue and a copper alloy belt?", "true_answer": "Empress Wu Zetian"}
{"task_id": "133", "question": "One Swedish wheelchair tennis player partnered with another Swedish wheelchair tennis player, and together they defeated Stéphane Houdet and Shingo Kunieda in the 2010 Wimbledon doubles final. The second Swedish wheelchair tennis player also partnered with Ronald Vink in the 2007 Wimbledon doubles and with Stéphane Houdet in the 2010 Wimbledon doubles. As of July 2010, how many Grand Slam titles has the first Swedish wheelchair tennis player won?", "true_answer": "Two"}
{"task_id": "134", "question": "An individual who authored a book asserting that Jesus used parables as advertisements, served as a U.S. Congressman from 1913 to 1915, co-founded an advertising agency that created the radio series \"Cavalcade of America,\" collaborated with DuPont to produce historical dramas promoting products, and established corporate storytelling as a branding strategy, died in July 1967. What was his profession and age at death?", "true_answer": "Bruce Barton was an American advertising executive and co-founder of BBDO, and he died at the age of 80"}
{"task_id": "135", "question": "An Icelandic striker was recruited by a football club during the second half of the 1990-91 season. In February 1991, the club experienced a tragic accident resulting in three deaths, including their captain and coach. The club was dissolved in 1991 and later reformed as a new club after the accident. The reformed club adopted a bear as its crest symbol, replacing the previous D-shaped logo, and lost rights to the original crest. What is the name of the Icelandic striker?", "true_answer": "Tómas Ingi Tómasson"}
{"task_id": "136", "question": "What is the name of the band that released a 2005 demo album containing their cover of a song originally composed by the composer of the musical \"This Ain't No Disco\"? This song participated in the POLYGLOT Initiative, was translated by the Portugal partner, distributed on Spotify, translated into multiple languages, and was performed by a Brazilian band that released their first demo in the 2000s.", "true_answer": "Star 61"}
{"task_id": "137", "question": "Who is the person who co-created the first blues guitar instruction book, which includes tablature, along with the creator of a neo gospel album who collaborated with the lead guitarist of Blitzen Trapper, who restored the vintage Gibson Hummingbird guitar damaged by Hurricane Sandy?", "true_answer": "Ivor Mairants"}
{"task_id": "138", "question": "\"What is the name of the theatre where the play, which was first published as a book on the same day as its stage debut and was written by the playwright who also wrote a satirical critique of local government budget cuts that premiered at the Royal Court Theatre in 2014, began its North American tour?\"", "true_answer": "James M. Nederlander Theatre"}
{"task_id": "139", "question": "In which year was the German rower born who competed with Kathrin Boron in the Women's Double Sculls event at the 2003 World Rowing Championships—the last event before transitioning to Quadruple Sculls—achieved a medal awarded to the Women's Double Sculls team at that event, was a member of the German rowing team that won a gold medal in the Women's Quadruple Sculls at the 2006 World Rowing Championships, and won a bronze medal (3rd place) at the 2008 Beijing Olympics held at the Shunyi Olympic Rowing-Canoeing Park in the Final A of the Women's Quadruple Sculls event, which required qualification through Repechage?", "true_answer": "1978"}
{"task_id": "140", "question": "What is the publication location of the 9th edition of a work that covers the history of Iberian colonies in the New World and analyzes the economic role of sugar plantations in colonial Brazil?", "true_answer": "New York"}
{"task_id": "141", "question": "What is the name of the team that was represented in a MotoGP race in July 2010 by someone who won a 2010 MotoGP race at Indianapolis Motor Speedway, a race that coincided with a Moto2 race having an eight-bike starting crash and resulted in a red flag and support race restart?", "true_answer": "Honda"}
{"task_id": "142", "question": "There is a train that crashed in a certain location. A rail accident occurred in that same location, resulting from track misalignment caused by unsecured anchor spikes, and it involved that train. Another rail accident in the same location resulted from insufficient track anchors and involved the Baseball Special train. What is the destination of this train?", "true_answer": "Philadelphia"}
{"task_id": "143", "question": "How many senators voted against the Supreme Court confirmation vote that, for the first time since 1987, confirmed a nominee with no prior experience as a judge, and among these senators is one who held the position of Attorney General, carried a resignation letter for a year, and served during an investigation—the first since the Watergate scandal—that examined collusion involving the sitting president's campaign and a foreign power?", "true_answer": "37"}
{"task_id": "144", "question": "What is the name of the person who held a position in a country in July 1912 and was involved in an event that occurred in that month? This event led to a response occurring in August 1912 in the same country. This person held the same position as another individual who was appointed in July 1912 in a country located in the Balkan region following the assassination of Mahmud Shevket Pasha. An event that was a consequence of this other individual's leadership occurred in August 1912 and involved military disarray.", "true_answer": "General Luis Mena"}
{"task_id": "145", "question": "In which year was the Jordanian politician born who held a judicial position in Jordan overseeing Shia personal status cases not governed by Hanafi jurisprudence, who was also a member of the first Jordanian legislative body to establish this position, has a child who is also a Jordanian politician and held the position of Member of the Parliament of Jordan for Al Karak until 1966, and is the grandparent of Tareq Suheimat?", "true_answer": "1875"}
{"task_id": "146", "question": "What is the number of Aboriginal deaths due to inter-tribal violence that occurred between 1835 and 1855 in a region that was historically known by one name and now has a modern name, as stated by a researcher who, working in that region, used demographic backcasting to estimate inter-tribal conflict casualties during that period by analyzing 19th-century police reports, settler diaries, missionary records, and Native Police records? This region was the site of a colonial conflict involving an Indigenous group resisting European settlers through guerrilla raids on livestock, which resulted in the settlers employing a tactic that involved Native Police from the Kulin Nation.", "true_answer": "200"}
{"task_id": "147", "question": "What is the title of the article that discusses anti-Asian racism and resistance in Mexico, authored by an assistant professor affiliated with an ethnic studies department, who also authored a study on Korean migrants and the 2017 Mexico earthquakes focusing on transnational responses of the Asian diaspora post disaster, and whose department offers a course that includes readings on assimilation patterns of Chinese migrants in Lima, Peru?", "true_answer": "Racial Transmittances: Hemispheric Viralities of Anti-Asian Racism and Resistance in Mexico"}
{"task_id": "148", "question": "Consider a person who co-founded an organization that was awarded the Boldest Crypto award, received that award at the BOLD Awards 2022 hosted by H-FARM, and focuses on blockchain technology. This person is also the CEO of another organization that partnered with Blue Meridian Partners, created a 5-year scaling plan for expanding its network across the U.S., and has a partnership year of 2023. Additionally, this person has a role at a cosmetics company that has a foundation which partnered with the Malala Fund, is part of the stand4her campaign, and is a foundation of that cosmetics company. What role does this person have?", "true_answer": "Chairman and CEO"}
{"task_id": "149", "question": "An organization was created on 14 April 1981. During the 1980s, it organized alternative education programs. It represents factories, including a specific factory. This organization collaborated with another organization founded in October 1980, which organized the commemoration of the 1968 student protests, an event significant and key to its establishment. How many factories does the first organization represent?", "true_answer": "Seventeen"}
{"task_id": "150", "question": "Who served under Donald Trump, opposed police body cameras, issued a May 2017 memo directing federal prosecutors to pursue maximum penalties for drug offenses, and requested what from congressional leaders in May 2017?", "true_answer": "To repeal the Rohrabacher–Farr amendment"}
{"task_id": "151", "question": "At which location did the convention that took place in July 1962, which was a convention of an organization refounded in 1950 and a founding member of the organization that organized the convention, occur?", "true_answer": "Dortmund"}
{"task_id": "152", "question": "\"What is the name of the person who is the great-niece of a woman who was a Union Army spy during the American Civil War, freed approximately 700 enslaved people, led a mission planned by Colonel James Montgomery that occurred on the Combahee River, and who launched a vessel named after her great-aunt?\"", "true_answer": "Eva Stewart Northrup"}
{"task_id": "153", "question": "What is the name of the publisher of the book that has an online chapter \"electric and hybrid vehicles\", and is aligned with an industry standard used in automotive technician training programs and forms the basis of ASE Education Foundation accreditation criteria?", "true_answer": "Jones & Bartlett Learning"}
{"task_id": "154", "question": "\"At what location was the art collection sold that belonged to the person who introduced positivism philosophy by translating the works of its founder, whose proposed principles formed the basis for 'Order and Progress'?\"", "true_answer": "At Bracondale, her cousin's estate"}
{"task_id": "155", "question": "In the final match of a 2005 Grand Slam tournament held in July 2005, a player who achieved her fifth singles title that year and won the doubles title after teaming with a player who participated in the 2005 Australian Open singles—facing Maria Sharapova in the semifinals (saving match points) and defeating Lindsay Davenport in the final—competed against an opponent who became the first mother to reach a Grand Slam final since 1980 after participating in the same tournament, and who had previously won the 2005 Toray Pan Pacific Open Singles title by defeating a professional tennis player in the final. How long did this match last?", "true_answer": "2 hours and 45 minutes"}
{"task_id": "156", "question": "How many games played in October by the team that plays at the eighth oldest football stadium in England, which had a record attendance of 47,671 during an FA Cup match against Sheffield Wednesday in 1930, under the management of the first Australian-born head coach of an A-League team, were not won by that team?", "true_answer": "Six"}
{"task_id": "157", "question": "In the late 1890s, a suffragist who founded an establishment in Auburn, NY (the first in New York to be supported by the National Association of Colored Women's Clubs for elderly care), worked with another suffragist focused on racial and gender equity (who organized a meeting in Rochester, NY in 1866 to advocate for a universal suffrage amendment to New York's state constitution and collaborated with Frederick Douglass during the suffrage campaign), and collaborated with a church in Rochester, NY (which hosted meetings of the Equal Suffrage League formed by suffragists of color and operated in the late 1890s). Seeking medical help for head trauma, she went to a certain destination. What is the name of this destination?", "true_answer": "She went to Massachusetts General Hospital in Boston"}
{"task_id": "158", "question": "What is the content of the description of the personality of the first elected governor of Indiana, who was initially defeated in an election due to Federalist Party mislabeling and served as governor starting in 1816, that was given by the historian who co-authored with an expert in early American military history affiliated with the University of Colorado Boulder and author of \"Crucible of War: The Seven Years' War and the Fate of Empire in British North America, 1754-1766\", and who produced a work that examines the relationship between war and the coexistence of empire and liberty, analyzes historical conflicts spanning the colonial era to the 21st century, includes case studies of the Seven Years' War and the Mexican-American War, and connects Samuel de Champlain's colonial efforts and Colin Powell's modern military leadership?", "true_answer": "Cayton describes Jennings as ambitious, passionate, hot-tempered, and moody"}
{"task_id": "159", "question": "On what date did the aircraft, which was the first to feature a modified flight cabin for crew comfort and the Red Steer tail warning radar, lose power on all its engines?", "true_answer": "14 June 1962"}
{"task_id": "160", "question": "\"What is the birth year of the Indian actress who studied at an institution that has a Department of Physics and Materials Science and Engineering, received a ₹2.22 Crore grant from the Department of Science and Technology for quantum communication research, and collaborates with Palacky University in the Czech Republic; and who starred in a 2021 film directed by Laxman Utekar and produced by Maddock Films, which is a remake of 'Mala Aai Vhhaychy!', has the theme of surrogacy, and required the protagonist to gain 15 kg of weight?\"", "true_answer": "1990"}
{"task_id": "161", "question": "In what year was an American baseball pitcher born who holds a Detroit Tigers record, has more than 200 career wins as a starting pitcher, and achieved 4 shutouts in a single season (1914)?", "true_answer": "1889"}
{"task_id": "162", "question": "What is the name of the entity that released the book which discusses closed-loop economy implementation by multinational corporations in the metals industry and includes contributions from industry experts, NGOs, and scientists?", "true_answer": "Springer"}
{"task_id": "163", "question": "What is the name of the recognition that the former Supreme Court Justice and author of \"Six Amendments: How and Why We Should Change the Constitution\" received from the organization that publishes newsletter archives on Oxfordian theory research, including analyses of Edward de Vere's connection to Shakespeare's works?", "true_answer": "He was appointed Oxfordian of the Year"}
{"task_id": "164", "question": "What is the name of the person who was blamed for incompetence that led to an event causing French forces to be forced into an unwanted general battle during the 1557 Battle of Saint-Quentin retreat, which involved mismanagement at the Somme River ford?", "true_answer": "Montmorency"}
{"task_id": "165", "question": "How many mortars were fired in 1994 by an agent who, in 1990 in the Netherlands, killed Australian tourists after mistaking them for off-duty British soldiers, at a location in London that features a birdwatching hide shaped like an air traffic control tower and is a founding signatory of a conservation initiative that aims to protect the bittern species?", "true_answer": "12 mortars"}
{"task_id": "166", "question": "What is the name of the website where a person used to post his opinions on free speech absolutism, using an online persona that participated in bomb plot communications, used threatening language to discuss bomb enhancements, and targeted an entity that features a 14-foot segment of World Trade Center steel and was the target of a bomb plot involving a pressure cooker device with nails and rat poison?", "true_answer": "Thought Catalog"}
{"task_id": "167", "question": "In what year did the selling water event start where the seller, located in Ontario and named after a Leander-class light cruiser that participated in the Battle of the River Plate, sold water to a buyer that is a village located in Ontario which hosts a water pollution control plant also located in Ontario, employing thermal incineration, biofilters, and activated carbon filters, and holding the ISO 14001 certificate?", "true_answer": "1953"}
{"task_id": "168", "question": "What significant contribution did the person who illustrated an unpublished children's story with a leprechaun and included the short story 'Topsy from Uncle Tom's Cabin' in the 1908 edition of 'Little Black Sambo' make to the pulp fiction magazine published in 1930 by a publisher, which contains the unpublished children's story with the leprechaun and a serialized story by A. Merritt that later became his 1931 novel, during the years 1930 and 1931?", "true_answer": "He contributed a great deal of artwork"}
{"task_id": "169", "question": "What is the value of the year in which the person who transferred 225,606,456 shares to Trust F-709 in 2008, and who was the chairman of a company that has a subsidiary called Casa Saba Brasil Holding, Ltda., which is located in Brazil, was born?", "true_answer": "1923"}
{"task_id": "170", "question": "After the 1990–91 season, a player transferred to a team. This player had 2 international matches and scored 18 goals, played for Team2 and an East German football team that won the 1974 Cup Winners' Cup by defeating AC Milan. His previous team started the 1990–91 season with four consecutive defeats and participated in a football league operated in East Germany, where BFC Dynamo achieved 10 consecutive championships from 1979 to 1988. Another player, with international caps for Team2, defected to West Germany in 1976 and was ineligible to play for unified Germany due to FIFA rules. What is the name of the team he transferred to?", "true_answer": "VfL Bochum"}
{"task_id": "171", "question": "Provide the description of the belief that is a common belief about Belgium and imperialism, which suggests that Belgians were reluctant imperialists. This belief is challenged by an author who analyzed the role of propaganda in supporting the colonial efforts in the Congo by Belgium, authored a book that examines and analyzes the 1897 Brussels International Exhibition photographs and propaganda methods, and challenges this belief. Additionally, a Belgian individual who was born in a certain place used Hubble's observations of receding galaxies and applied Einstein's theory of general relativity.", "true_answer": "The belief that Belgians were 'reluctant imperialists'"}
{"task_id": "172", "question": "\"What is the name of the position that was held in 1965 by an individual who, before 1993, developed a surgical technique replacing prosthetic valve replacement, involving delamination of valve leaflets and plication of the atrialized ventricle, to treat a congenital heart defect involving tricuspid valve displacement and associated with GATA4 gene mutation?\"", "true_answer": "Bishop of Viseu in Portugal"}
{"task_id": "173", "question": "What is the publication year of the book, edited by a philosopher who proposed the mock emotions theory in music and argues that musical expressiveness mimics genuine emotion without literal feeling, which challenges the ideology of composer-as-genius, opposes puritanical devotion to textual authority in early music performance, and argues for the performer's personal authenticity as valid interpretation?", "true_answer": "1995"}
{"task_id": "174", "question": "In May 2008, an Australian footballer—who failed to qualify for the Australian Institute of Sport as a youth, was mentored by the Director of Coaching for the NSW Soccer Federation's junior academy in 1989, and represented Australia in international football competitions—became the face of an Australian men's fashion brand. What is the name of this brand?", "true_answer": "Politix"}
{"task_id": "175", "question": "In what year was the letter compilation containing correspondence with major Victorian political and literary figures, edited by an individual affiliated with the University of Hull who also co-edited an academic anthology focusing on nineteenth-century intellectual disciplines published by Routledge, and published by a publisher that also publishes a work including a study analyzing Victorian women writers' engagement with ancient Greece and Rome, examines masculinity through Victorian perceptions of Roman antiquity, and is published by the Oxford University Press series?", "true_answer": "1990"}
{"task_id": "176", "question": "What is the date of the landing accident involving a strategic bomber with wing sweep angles of 48.5°, 37.5°, and 26.75°, which occurred at the Air Force Base where the first high-fidelity full-motion simulator for E-4B aircraft—used with that bomber—was delivered in July 2019?", "true_answer": "29 February 1988"}
{"task_id": "177", "question": "What is the nationality of the person who is the Chair of an institution that focuses on psychiatric drug withdrawal support, collaborated with Trinity College Dublin, participated in the PROTECT Study on psychiatric drug tapering, and authored a book that critiques biological psychiatry models and emphasizes trauma and social inequality as causes?", "true_answer": "British"}
{"task_id": "178", "question": "What is the name of the player who played for a football club based in East Germany with a venue that was first established in the DDR and includes a stadium and training complex, was the best goalscorer in the first half of the 1987 football season—which was a UEFA Cup qualifier against another East German football club that participated in a 1987 lower-tier German league match with the highest attendance of 12,421—and whose league had a match in 1988 involving SG Dynamo Dresden and FC Carl Zeiss Jena attended by Helmut Kohl?", "true_answer": "Andreas Thom"}
{"task_id": "179", "question": "In July 1962, a train crash occurred in Pittsburgh involving a train whose passengers were heading to an event. Pittsburgh was the site of a plant operated by Jones & Laughlin Steel Corporation, which produced structural steel for the Home Insurance Building. What is the name of the event the passengers were heading to?", "true_answer": "The Pirates-Phillies baseball game"}
{"task_id": "180", "question": "What is the name of the event that occurred in 2005 at a library constructed in 1916, located in a county that implemented a Library Maintenance Tax and received funding from a philanthropist who imposed the condition that towns contribute 10% annually, where both the library and the county benefitted from this philanthropist's funding?", "true_answer": "The renaming ceremony of the Royce Branch"}
{"task_id": "181", "question": "What is the restoration date of the aedicule located in Genoa, within a building that contains Pietro Romanengo Stefano and is part of the UNESCO World Heritage Site Strade Nuove, which contains a statue depicting St. George that is part of the 16th-century statue in the Chapel of the Immaculate Conception in San Pietro in Banchi church?", "true_answer": "1991"}
{"task_id": "182", "question": "What is the name of the scholarship awarded for sports stories that was won by a person who co-founded a genetic testing company conducting studies on essential thrombocythemia, requiring participants to provide DNA saliva samples and health surveys, aiming to enroll over 1,000 participants; established an organization that partnered with the Alzheimer's Association, funded a genetic study requiring DNA genome sequencing, which enrolled over 800 participants and aims to study Alzheimer's disease, and donated $50 million to a nonprofit organization leading global Parkinson's research that focuses on identifying Parkinson's disease biomarkers through longitudinal studies, launched the Parkinson's Progression Markers Initiative (PPMI), and lowered eligibility age to 40 years?", "true_answer": "A scholarship for her sports stories"}
{"task_id": "183", "question": "In which year was the German high jumper, who was a member of a team formed in 1971 after splitting from Turnverein Wattenscheid 01 (1901), won the German Championship in 1978, and achieved a personal best of 2.42 meters indoors, born?", "true_answer": "1957"}
{"task_id": "184", "question": "What is the nationality of the professional cyclist, mentioned in the text, who died in 2012 and had a tribute bike displayed at an event named after Jean-Pierre Monseré that occurred in 2012 and is part of the UCI Europe Tour?", "true_answer": "Belgian"}
{"task_id": "185", "question": "What is the type of aircraft that sank a U-boat in July 1943? The U-boat was commanded by a person who later served as the naval attaché of Germany in London after World War II. On September 5, 1942, this U-boat sank an iron-ore freighter in Canadian waters, which sank within 90 seconds. The freighter was in the only location in North America that experienced land attacks by U-boats during World War II.", "true_answer": "Martin PBM Mariner"}
{"task_id": "186", "question": "What is the name of the charges for which a manager, who won the FA Cup during the 2007-08 season as the manager of a football club that was relegated from the Premier League in the same season and participated in the UEFA Cup in the 2008-09 season, was arrested along with others?", "true_answer": "Conspiracy to defraud and false accounting"}
{"task_id": "187", "question": "What is the name of the sport played by the retired MLB player nicknamed \"La Melaza,\" who participated in an event that introduced the \"Power of Veto\" rule?", "true_answer": "Baseball"}
{"task_id": "188", "question": "What was the recorded time of the winner of the 213 km Tour de France stage that started in a location within the region of Hainaut, featured seven cobblestone sectors totaling 13.2 km including the Carrefour de l'Arbre, and was part of a Tour de France that had a general classification margin between first and second place of 39 seconds—the narrowest such margin since 1989?", "true_answer": "4 hours 49 minutes 38 seconds"}
{"task_id": "189", "question": "What is the percentage of aircraft orders secured, in the decade since 2003, by the company that collaborated with another company to introduce the first biomimetic lattice design product certified for use in commercial aircraft cabins, and whose collaborator has, since 2020, partnered with Stirling Dynamics and Proponent to develop certified 3D printed aircraft interior components?", "true_answer": "Over 50%"}
{"task_id": "190", "question": "\"An East German football club, which was associated with a secret police organization led by Erich Mielke and won ten consecutive league titles from 1978 to 1988, played a match on November 23, 1985, against another East German football club that was previously named FC Vorwärts Berlin, merged into 1. FC Frankfurt, and participated in the top division football league in East Germany, which had a special round in 1955 due to schedule changes resulting in no official champion, with SC Wismut Karl-Marx-Stadt finishing first. What was the score of this match?\"", "true_answer": "BFC Dynamo lost 2–1"}
{"task_id": "191", "question": "What is the birth year of an American journalist who started his career as a reporter at age 17 with a starting salary of $3 per week, worked for a newspaper that was the oldest continuously operated business in Glasgow, Kentucky until it closed in 2020, and helped establish the Huntley-Brinkley Report news team?", "true_answer": "1922"}
{"task_id": "192", "question": "What is the name of the person who issued the first 1962 employer contributions to social security mandate in South Korea?", "true_answer": "President Park Chung Hee"}
{"task_id": "193", "question": "What is the description of the precautions taken in the city located in Ohio that hosts a state fair exclusively since 1886, to prevent an event where a person who committed a bank robbery associated with a buried treasure theory in Oregon breaks out his pals?", "true_answer": "Elaborate precautions were taken to keep Pierpont and Makley locked up"}
{"task_id": "194", "question": "What is the name of the significant milestone achieved by a U.S. Navy pilot participating in the 200th anniversary celebration at Armitage Field, China Lake in 1975?", "true_answer": "He became the first Hispanic pilot to serve with the Blue Angels"}
{"task_id": "195", "question": "\"How old was the person who co-founded a Masonic body in Paraguay established in 1895, implemented a legal framework, held the position of president of Paraguay, and died in July 1912?\"", "true_answer": "61"}
{"task_id": "196", "question": "Name the American actress and singer who released an adult contemporary album in 1994, which featured collaboration with a string arranger who had worked with a hybrid jazz-classical orchestra that collaborated with Pat Metheny and won a Grammy with Snarky Puppy, and who also worked on an orchestral reworking of previous tracks that includes \"Star of Wonder,\" a song with a Middle Eastern vibe.", "true_answer": "Katey Sagal"}
{"task_id": "197", "question": "An individual inherited the ancestral home of the Allix family located in Swaffham Prior, supported an Act established in 1846 under the Parliament of Great Britain—which applies to Cambridgeshire county, includes provision section 228, and regulates the drainage system of Willingham—and served in a position until 1847. For what reason did he leave his position?", "true_answer": "He did not seek re-election"}
{"task_id": "198", "question": "What is the title of the book published in 1987, authored by someone who also wrote an inorganic chemistry textbook published in 1987 that uses an organizational method which categorizes compounds by class of compound, groups reactions by reaction mechanism, and differs from element-based classification?", "true_answer": "Principles of Descriptive Inorganic Chemistry"}
{"task_id": "199", "question": "What was the number of households located in the city where an institution established in 1407—the first to issue government bonds—had its headquarters, as reported in the first national census of a kingdom formed in 1861, mandated by its ruler?", "true_answer": "28931 households"}
{"task_id": "200", "question": "In July 2011, a Swedish football club that operated from 2011 to 2013 and had a women's team manager who previously managed the Sweden U21 national team from 2002 to 2004 and managed the club from 2011 to 2013 played two matches against a Luxembourgish football club. Earlier in April 2011, they had played a football match against the same Luxembourgish club, where the Swedish club scored 6 goals. This match was part of a football competition that held its first final at Stade Josy Barthel, with the final occurring in 2011. What was the aggregate score of the two matches played in July 2011 between the Swedish club and the Luxembourgish club?", "true_answer": "BK Häcken won 6-2 on aggregate"}
{"task_id": "201", "question": "What event occurred in 1982 to the mother of quintuplets, a group of five siblings who were placed under the guardianship of the Ontario Provincial Government after a custody case in the 1930s involving a form of guardianship exercised by governing bodies under the Crown, which both the quintuplets and their mother had custody cases invoking?", "true_answer": "She was murdered by her second husband"}
{"task_id": "202", "question": "What is the name of the team that was represented in the 9th round of the 2010 sports season by a race driver who participated in the European Touring Car Championship race held at Estoril in 2003, raced for a company whose subsidiary is CUPRA, which collaborates with Kiro Race Co participating in the 2024/25 Formula E season?", "true_answer": "Chevrolet, represented by the RML Group"}
{"task_id": "203", "question": "What is the name of the event concluded in July 1962 by the organization that reconstituted an entity established as the Innovation Fund in 2024 (partnered with the Government of Saskatchewan to support family physician-led team-based clinics) and separated the regulatory role of an entity whose bylaw specifies eligibility criteria for senior life members and requires postgraduate licensure duration in Saskatchewan?", "true_answer": "The Saskatchewan doctors' strike"}
{"task_id": "204", "question": "In which year did the Chicago-based American journalist and television personality, who won the George Foster Peabody Award recognizing pioneering work in talk show formats and founded in 1945 the first annual lake cruise for wounded veterans, pass away?", "true_answer": "2003"}
{"task_id": "205", "question": "In which year was the person—who is a person and served as the key leader in an initiative that was initiated by Daytona Beach hoteliers, was a response to riots caused by the filming of “Where the Boys Are” in Fort Lauderdale, and included an incentive of free beer and ping pong ball promotion—born?", "true_answer": "1925"}
{"task_id": "206", "question": "What is the name of the athlete who finished second in the women's javelin throw event, which was held at the venue that hosted the 2024 World Para Athletics Championships—the first occurrence in East Asia—and was part of the event that included Satomi Kubokura winning her third consecutive gold medal in the women's 400m hurdles at the Asian Athletics Championships?", "true_answer": "Wang Ping"}
{"task_id": "207", "question": "What materials were used for the envelope and inner layer of the first commercial device using heat pipe technology, which employs water as the working fluid and was developed by an organization that employs Ferro-Silicon Dense Media as a core medium, enables 24/7 hydropower generation independent of weather, can be reconfigured for green hydrogen production via electrolysis, and is designed for Brownfield sites near power demand centers?", "true_answer": "The envelope was stainless steel, and the inner layer was copper"}
{"task_id": "208", "question": "What is the name of the company that released in 2014 a book authored by a football manager who managed a football club that had transfer talks with Valeri Bojinov in 2014, allowed a fan who scored during a match, and joked that the fan's nationality is Bulgarian international?", "true_answer": "Ebury Press"}
{"task_id": "209", "question": "In which year did the event occur that was the first game in North America for a player who participated in the 1998 World Junior A Challenge (hosted in Timmins, Ontario), was a member of the Sweden national under-18 team, and later became the Vancouver Canucks captain, where that event involved a team that topped Preliminary Group A but lost the final to the host nation team, was part of the tournament in which Sweden won silver, and that tournament—originally known as the Quebec Esso Cup, started in 1986, organized by Hockey Canada, with the Soviet Union as its first champion—was hosted in a city in Alberta that was the first non-Quebec host of the Quebec Esso Cup (now known as the World U17 Hockey Challenge) and also hosted the Quebec Esso Cup?", "true_answer": "1997"}
{"task_id": "210", "question": "\"In which year did the Australia men's national team play a semi-final match against the Uruguay men's national team in the FIFA Confederations Cup, which was decided by a golden goal scored by an Australian player who was selected for a team in that year that included another player who had played for Australia and won both the Bundesliga and the J League Cup?\"", "true_answer": "1997"}
{"task_id": "211", "question": "What is the name of the publishing company that reissued in 2009 a work which is the translation and condensation of a philosophical work authored by a French philosopher who developed positivism, coined the term \"altruism\" (defining selflessness towards others), established the \"Religion of Humanity\" (a secular religion), and systematically organized the sciences in a hierarchical order from mathematics to sociology, culminating in sociology, thereby defining the first scientific taxonomy? This translation and condensation was done by an author who translated the original work, created a series of short stories explaining political economy principles using narrative (published between 1832 and 1834), and authored the first work to systematically address social research methodology, which includes guidelines against ethnocentric bias and provides frameworks for impartial social observation.", "true_answer": "Cambridge University Press"}
{"task_id": "212", "question": "In which year was the Uzbekistani tennis player born who won the singles title at the inaugural ITF $25k tournament in Qujing held in 2016?", "true_answer": "1994"}
{"task_id": "213", "question": "How much petrol was delivered by the port that served as the departure point of the first convoy in the HX convoy series during World War II, escorted by HMCS St. Laurent and HMCS Saguenay, to the capital city of Belgium in support of the Second Army, where this city was the destination of a convoy that transported supplies for the Second Army, was part of the HX convoy series during World War II, was attacked near Mechelen, involved the sinking of SS Sunoil (an American merchant ship), was targeted by multiple U-boat flotillas operating in the North Atlantic, and occurred in April 1943?", "true_answer": "Around half a million gallons"}
{"task_id": "214", "question": "What is the birth year of the New Zealand air marshal and pilot who ferried an aircraft operated by the Royal New Zealand Air Force, which was retired by 1952, from England to New Zealand via Malta and Singapore, and who held a position after 1974?", "true_answer": "1923"}
{"task_id": "215", "question": "In what year was the book published that is a book covering fluid flow, heat transfer, and mass transfer, is part of a series that includes a volume edited by Ajay Ray covering distillation, absorption, and membrane separation techniques?", "true_answer": "1999"}
{"task_id": "216", "question": "An entity utilized an archive and analyzed an event that involved or attempted a power grab against a post-Cultural-Revolution power struggle or Hua Guofeng, resulting in the arrest of Jiang Qing and three others, and included orchestrating 729511 Cultural Revolution persecution cases. That entity states that Jiang Qing remained at a certain place until her death. The archive holds the Rock J. Shih Collection documenting U.S.-Taiwan–China diplomatic relations about Rock J. Shih. That place is ?", "true_answer": "Qincheng Prison"}
{"task_id": "217", "question": "On which date was the three-day, multi-front event initiated by the Cameroonian military force—part of a counter-insurgency operation carried out by this military against Anglophone separatist insurgents, enforcing a temporary motorcycle traffic ban, and occurring in Bamenda—that happened in a location in Cameroon renowned for palm wine and raffia palm cultivation, containing Mount Oku (the second highest mountain in West Africa) and Lake Nyos (a crater lake), and home to a society that practices a tradition involving elephant masks used in death ceremonies; the event was against a group that had carried out an attack in 2020 in a province of the Democratic Republic of the Congo, which contains the Okapi Wildlife Reserve (a UNESCO World Heritage Site), resulting in the abduction of 100–200 civilians and the looting of livestock, medicine, and food; moreover, the Cameroonian military had participated in a UN multinational mission starting in March 2014, deploying to the Central African Republic to conduct peacekeeping against forces who signed a peace agreement in 2019 but continued committing violent activities, and this mission resulted in casualties among personnel?", "true_answer": "July 31"}
{"task_id": "218", "question": "What is the name of the organization that, in July 2010, dismissed a sumo wrestler who had the highest rank of ozeki, participated in an event involving the Seibu Lions that is related to a scandal which caused NHK to stop live sumo broadcasts, occurred in July 2010, used a hairdresser acting as a courier between sumo wrestlers and the yakuza, and also involved the Seibu Lions?", "true_answer": "Japan Sumo Association"}
{"task_id": "219", "question": "Who was the candidate in the 2022 Conservative Party leadership election, who was endorsed by an MP who held a cross-departmental policy oversight-providing Cabinet Office role with no specific department in Cabinet, served from November 2023 to July 2024, and was tasked with combating wokery, and who is the MP for a UK Parliament constituency that had a 1997 by-election won by Martin Bell defeating Neil Hamilton arising from the parliamentary expenses scandal, where the leadership election took place while the Prime Minister of the United Kingdom held office and resigned after the election?", "true_answer": "Hunt"}
{"task_id": "220", "question": "What is the number of pages of the trade paperback edition of a work that features an antagonist who is a member of the first Outsiders, adopts Emiko, is an antagonist in Green Arrow, and is motivated by a lineage secret of Robert Queen involving a child born to Shado? The work also includes storylines involving the origin of Green Arrow's combat techniques—a period of rigorous survival training originating from training linked to Shado and used against the antagonist.", "true_answer": "208 pages"}
{"task_id": "221", "question": "What is the name of the period during which a demographic shift occurred, fueled by a convict labor system and a recruitment program, both operating in Van Diemen's Land, where the convict labor system was part of the probation system for convicts, required female convicts to perform hard labor including washing naval uniforms, and the recruitment program targeted unmarried British women of middle-class moral standards, provided free passage via government-authorized ships, collaborated with colonial emigration agents, and had the goal to address gender imbalance through morally vetted immigration, addressing settler labor shortages and gender imbalance?", "true_answer": "Between 1830 and 1850"}
{"task_id": "222", "question": "Which car brand has the name “?”, where that brand was driven by a race car driver (who drove a car with number 1 for a race team) who participated in a NASCAR race that was the third race in a series achieved by that same team—this series was the first instance of a team owner winning the Daytona 500, Indianapolis 500, and another race in the same season—and that particular NASCAR race took place at a location that also hosted an August 19, 1909 race involving a Knox car which resulted in the deaths of William Bourque and Harry Holcomb; moreover, the driver won another NASCAR race that was halted twice due to a pothole in the pavement, and the team he drove for is a race team with the most Indianapolis 500 wins and also won the 24 Hours of Le Mans?", "true_answer": "Chevrolet"}
{"task_id": "223", "question": "An author, who along with their spouse co-authored a work under the pseudonym \"Hal Debrett\", authored a series using an element associated with a detective series that has over 300 books and features a protagonist who never uses guns and relies on fistfights. In which year did this author die?", "true_answer": "1977"}
{"task_id": "224", "question": "Consider a collection of letters that includes letters from a 19th-century British author to a woman who sent letters to a man in 1828. This woman and the youngest daughter of Josiah Wedgwood II are sisters. The man received letters from the same 19th-century British author in 1828 and later married the youngest daughter of Josiah Wedgwood II, joining the Wedgwood family. The 19th-century British author freely translated and condensed a 19th-century English translation, which was condensed into two volumes from an original French philosophical work and is referenced in the collection of letters. In what year was this collection of letters published?", "true_answer": "1983"}
{"task_id": "225", "question": "\"What is the number of pages of volume 2, which shares its title with a short story it contains, published by a publisher who also released 'Youngblood #1' with a pre-order record of 930,000 copies? The short story was written by an author who collaborated with Matt Triano and wrote 'The Devilers'—a demonic thriller published by Dynamite's creator-owned imprint in 2014—and was illustrated by an artist who created 'Fishflies' (a serialized comic strip published in 'Tales from the Farm newsletter'), co-wrote 'Plutona' with Emi Lenox, and illustrated 'AD: After Death' written by Scott Snyder.\"", "true_answer": "240 pages"}
{"task_id": "226", "question": "Who created the bronze statue, placed in 1886, that commemorates the first king of unified Italy, located in a place established in 1877 as part of the 19th-century urban redevelopment in Genoa?", "true_answer": "Francesco Barzaghi"}
{"task_id": "227", "question": "What is the name of the act aimed at banning discrimination based on sexual orientation, which was voted in favor of in 2007 by a U.S. Senator who co-sponsored an act establishing the Presidential Task Force on Wildlife Trafficking, served on a committee that oversees treaty review of the Marrakesh Treaty (which establishes guidelines for accessible books for visually impaired individuals), and had a co-sponsor who is a U.S. Senator representing Delaware, serves on the Senate Judiciary Committee, and who sponsored the Fair Credit for American Hostages Act (an act that aims to address credit reporting issues for hostages)?", "true_answer": "The Employment Non-Discrimination Act (ENDA)"}
{"task_id": "228", "question": "What is the name of the country that has a mosque, which is part of a UNESCO World Heritage Site, located within its borders, and this mosque has intricately carved wooden columns including columns dating to the 10th and 19th centuries?", "true_answer": "Uzbekistan"}
{"task_id": "229", "question": "In which city was a publication released that contains letters by three English women about their travels in America, documents critiques of 19th-century American society, and is included in a series that also includes a volume edited by Christopher Hibbert documenting memoirs of British soldiers' experiences in the Napoleonic Wars? The publication was compiled from writings by:\n\n- A woman who translated \"The Positive Philosophy of Auguste Comte\", authored \"Society in America\", and criticized slavery practices in the American South;\n- A woman who authored \"Journal of a Residence on a Georgian Plantation in 1838–1839\", was married to and separated from Pierce Butler; whose journal documents antebellum Southern plantation life and critiques slavery practices in the American South;\n- A woman who authored \"Michael Armstrong, the Factory Boy\", categorized as the first British industrial novel, which critiques child labor practices in 19th-century textile mills.", "true_answer": "London"}
{"task_id": "230", "question": "In a scenario where one team was defeated by X in the 1981 UEFA Cup third round and another team reached the semi-finals of the 1983 European Cup Winners’ Cup—an event won by Aberdeen at Tynecastle Stadium—these two teams eventually formed a merged team. Meanwhile, X reached the semi-finals of the 1983–84 European Cup, faced AS Roma in the 1984 European Cup semi-final, and was involved in a controversy about match fixing allegations during its European campaign. If a season is the one right before the merger of the two teams, the final league position of the original team in that season has the value ?", "true_answer": "15th"}
{"task_id": "231", "question": "Who ordered the dispatch of the first deployment of the Worker-Peasant Thought Propaganda Teams in July 1968, which ended the armed combat involving grenades and Molotov cocktails caused by the split of the Jinggangshan Red Guards in April 1967 and concluded with propaganda team intervention in July 1968?", "true_answer": "Mao Zedong"}
{"task_id": "232", "question": "What is the name of the group who visited in early 1074 the person who held the titles of King of the Romans and anti-king of Germany, in the city that granted exemptions to Jewish and citizen communities that year and later hosted opposition to the event performed by Siegfried I, Archbishop of Mainz, in 1077, which resulted in exile to Saxony, involved that king, and was opposed by the citizens of Mainz?", "true_answer": "Liemar, Archbishop of Bremen, Udo, Archbishop of Trier, and eight bishops"}
{"task_id": "233", "question": "What is the name of the fighter who holds the record for the most Fight of the Night bonuses in UFC history, won a welterweight bout in July 2010 against a UFC welterweight who holds the record for most knockouts in UFC welterweight history and ranks second in the all-time UFC knockout list behind only Derrick Lewis, and held a championship that was first won by the fighter nicknamed \"Semtex\" at Cage Rage 23?", "true_answer": "Chris Lytle"}
{"task_id": "234", "question": "\"In which year did the Swedish player who pioneered the 'cycle game strategy', and who together with his twin brother—a Swedish-born player who won the Art Ross Trophy in the 2010–2011 season playing for the Vancouver Canucks—co-received an award given for Sweden's top athlete, first represent Sweden in the junior category of a competition hosted in Sweden in 1972 where Sweden won the gold medal?\"", "true_answer": "1997"}
{"task_id": "235", "question": "What is the name of the platform that has the purpose to accelerate the deployment of heat pumps and was launched by an organization aiming to achieve an 80-95% reduction in CO₂ emissions from EU steel production by 2050? This organization co-leads an initiative with another platform. The initiative develops hydrogen plasma smelting reduction technology for iron ore processing, is funded under the Horizon Europe program's initiatives, and aims to eliminate fossil fuel dependency in steel production through green hydrogen integration. The other platform leads a project that aims to enhance scrap metal purity for cleaner steel production, is funded under the Horizon Europe program, and aims to reduce dependence on virgin raw materials in steelmaking.", "true_answer": "Heat Pump Accelerator Platform"}
{"task_id": "236", "question": "Which person, who is the founder of an entity that publishes a work authored by Paola Uparela that examines visual regimes of female bodies in early modern medicine and literature, received the LASA Visual Culture Prize, and is part of a book series edited by Julio Ortega that focuses on the interdisciplinary redefinition of Hispanism through transatlantic dialogue, has the name ?", "true_answer": "Klaus Dieter Vervuert"}
{"task_id": "237", "question": "In 1908, voters in Texas replaced a form of government that had a structure requiring a two-thirds majority for school tax approvals with a new form of government. They also approved a constitutional amendment that established a maximum tax rate of $0.05 per $100 valuation and modified the voting requirement for school tax approvals from a two-thirds majority to a simple majority. What is the name of the new form of government that was adopted in Texas in 1908?", "true_answer": "Commission government"}
{"task_id": "238", "question": "In which year did a Republican U.S. Senator from Arizona, who co-created a reality survival show set in the Marshall Islands featuring U.S. Senators with opposing partisan affiliations, and who collaborated with a U.S. Senator from New Mexico who previously served as mayor of Albuquerque, vote three times to repeal a law that had included and then removed a long-term care insurance program which was included in a federal health care law and was repealed by the American Taxpayer Relief Act of 2012?", "true_answer": "2017"}
{"task_id": "239", "question": "In what year was the cyclist born in the Netherlands, who represented Australia in the Olympics, won a Jacob's Creek-sponsored edition of the Tour Down Under, and has a 4-meter-wide veloway with safety features including emergency exits and CCTV running alongside the Southern Expressway named after him, born?", "true_answer": "1969"}
{"task_id": "240", "question": "What is the number of pages in the first volume of the first issue of the series that received the 2019 Eisner Award for Best New Series, which uses rotating panel layouts to depict non-linear storytelling across timelines, features Andrea Sorrentino's atmospheric horror art, and explores themes of occult rituals, obsession, mental illness, and disintegration? The first issue centers on the legend of a mysterious barn appearing across rural and urban settings.", "true_answer": "160 pages"}
{"task_id": "241", "question": "What is the name of the senior officer who succeeded Col. Alfredo Rillera in a position held within an organization that operates Camp Melchor Dela Cruz—a military training facility established under the Enhanced Defense Cooperation Agreement (EDCA)—where this position involves improper authorization leading to casualties from an unauthorized military engagement, and oversees a military operation that took place in Basilan, involved conflict with the Moro Islamic Liberation Front, resulted in 19 soldiers killed, was triggered due to unauthorized entry into the Area of Temporary Stay (ATS), and led to court-martial against senior military commanders?", "true_answer": "Col. Salvador Mison"}
{"task_id": "242", "question": "\"What is the name of the church outside the walls of Genoa that was later entrusted to an entity which held a region since 972 and controlled religious buildings in a region that was part of the Levante district, an administrative division of the Republic of Genoa that controlled coastal trade routes since the 12th century?\"", "true_answer": "Church of St. Stephen"}
{"task_id": "243", "question": "In which year did the Italian racing driver, who participated in the Mille Miglia race won by Eugenio Castellotti without a navigator, driving the Alfa Romeo model nicknamed \"Disco Volante\" inspired by flying saucer shape, and who caused a crash resulting in the destruction of the car, pass away?", "true_answer": "1998"}
{"task_id": "244", "question": "In July 1904, an organization held a mass meeting at a location to celebrate the death of a person who had enforced the execution of an individual who, in 1902, formed a group consisting of four Jewish workers and two Polish workers and planned an assassination against Governor Von Wahl. The person whose death was celebrated had also been the target of an assassination attempt in 1903 against Fyodor Dubasov, which was carried out by the Socialist Revolutionary Combat Organization. The organization had a member who proposed a covert educational network during the 1904 revolutionary meeting, which also occurred in July 1904. What is the name of the place where the mass meeting occurred?", "true_answer": "Cooper Union in New York City"}
{"task_id": "245", "question": "What is the name of the company that manufactures ice resurfacing machines, has tires featuring approximately 400 tungsten carbide studs per set, and was founded in 1988?", "true_answer": "Zamboni Company"}
{"task_id": "246", "question": "A wrestler won an award for a move executed during SummerSlam, which is produced by a company that became a subsidiary of 20th Century Fox TV and signed a deal in 2009. This wrestler also signed a deal with the same company in September 2009. What is the name of the deal the wrestler signed?", "true_answer": "A deal to appear in a reality television show"}
{"task_id": "247", "question": "What is the name of the person who held a diplomatic role, had an assassination attempt in July 1965, and whose diplomatic role was also held by another person who was present during an event in Saigon in 1965 that marked the first death of a female CIA officer?", "true_answer": "Maxwell D. Taylor"}
{"task_id": "248", "question": "At what time did the mortgage paying off event take place, in which the agent was a military leader from the American Civil War, who shares the same affiliation as James Montgomery, was led by a group also from the American Civil War that is led by James Montgomery and involves the 2nd South Carolina Volunteers, and the mortgage being paid off applied to a farm owned by that agent?", "true_answer": "May 1873"}
{"task_id": "249", "question": "What is the number of pages of the encyclopedia book that is part of the \"Golden Encyclopedia\" series, contains an entry on \"zither\", and was published by a publisher founded in 1958 that is a subsidiary of HarperCollinsPublishers and The News Corporation Limited, and which also published the \"Golden Book Illustrated Dictionary\"?", "true_answer": "720 pages"}
{"task_id": "250", "question": "In which year did an actor who appeared in a soap opera, played the drummer in the Queen biopic, performed as a percussionist in Hamilton, and was repeatedly named \"Weird Crush\" winner by Heat magazine, appear in Heat magazine?", "true_answer": "2015"}
{"task_id": "251", "question": "\"What is the name of the sport played professionally by a person born in the city nicknamed 'City of Seven Hills' in Trujillo State, Venezuela, who shares a nickname with a racehorse from the same state that won the Clásico Millard Ziadie?\"", "true_answer": "Baseball"}
{"task_id": "252", "question": "What is the name of the country that withdrew its remaining troops from another country in July 1968? That other country had supplied arms to a third country during a conflict that occurred before 1950, which was conducted by the Jordanian Arab Legion and used 25-pounder howitzers. During 1965, the third country received M-48 Patton tanks procured via West Germany.", "true_answer": "The Soviet Union"}
{"task_id": "253", "question": "What was the role of the Spanish ambassador to France who served as the first director of a museum initially built for natural history—later reestablished by royal decree after the 1812 Constitution’s abolition, maintained through royal ecclesiastical authority, and housed in a repurposed building designed by Juan de Villanueva—while being part of the court that prevented the transfer of the patronato real post-constitution abolition under the same ecclesiastical control?", "true_answer": "Mayordomo mayor (High Steward)"}
{"task_id": "254", "question": "What is the title of the book that discusses a conflict resulting from the Soviet intervention in Afghanistan, which ended with a military withdrawal occurring in Afghanistan, involving the Soviet Union, and whose last participant was Boris Gromov? This book is published by the same publisher as a nonfiction book authored by Nancy Pick, including contributor Edward O. Wilson, that discusses Nabokov's butterflies and focuses on a collection containing the stibnite crystal from Wuning Mine.", "true_answer": "The Great Gamble: The Soviet War in Afghanistan"}
{"task_id": "255", "question": "What was the outcome of the battle that occurred in July 1950 at a key communication center south of the position of a military division whose commander was captured in the Battle of Taejon, which also took place in July 1950 and in which the division participated?", "true_answer": "The Battle of Yongdong ended in a North Korean victory"}
{"task_id": "256", "question": "To which location did the French royalist specialized in tropical botany, who led an expedition to Brazil from 1816 to 1822 during which he documented Brazilian physical geography and natural resource uses, take the copper bathtub—a historical artifact previously owned by a political figure assassinated in it—that he used as a container for tropical plant preservation during the expedition?", "true_answer": "Sarzeau, Morbihan in Brittany"}
{"task_id": "257", "question": "What is the name of the driver who, in July 2010, became the third driver to win both of the two NASCAR races held at a track that hosts the Rolex 24 At Daytona and enforces a 20% lighting capacity restriction during night events, and at a track that had its inaugural event as a balloon competition in 1909, has a layout with two 5/8-mile straightaways and four 1/4-mile turns connected by two 1/8-mile straights, and hosts a 500-mile race, where these two NASCAR races were first won in the same season by a team owner who achieved his 100th IndyCar victory in 2015 along with that 500-mile race?", "true_answer": "McMurray"}
{"task_id": "258", "question": "\"In which year was the article published that was written by a scholar who edited the two-volume 'Libanius: Autobiography and Selected Letters' in the Loeb Classical Library, which identifies a work spuriously attributed to Eunapius and appearing in the Suda, and resolves discrepancies among the works of Ammianus Marcellinus, Eunapius, and Zosimus?\"", "true_answer": "1957"}
{"task_id": "259", "question": "On what date did a midair collision occur involving two aircraft assigned to the RAF strategic reconnaissance role, one equipped with a bomb bay-mounted radar mapping system and the other equipped with a side-looking airborne radar with target-marking capability requiring modification involving crew seat removal?", "true_answer": "19 August 1968"}
{"task_id": "260", "question": "\"Who was the head of an organization that orchestrated a three-phase military operation in the 1980s, codenamed after Túpac Amaru II with the objective to destabilize Jammu and Kashmir through insurgency as part of Pakistan's military strategy, and who held a position during a 1988 operation that was part of diversionary tactics, located in a place within Nangarhar Province that has the archaeological site of Hadda containing ancient Buddhist statues from the Gandhara civilization?\"", "true_answer": "Hamid Gul"}
{"task_id": "261", "question": "What is the name of the place where a physician, who was trained in medicine under the first physician of Bethel Hospital, Norwich during the 18th century, practised during the 1720s after holding the position of physician for 50 years at a place that conducted extensive medical investigations into soldiers' medical issues from service during the 18th century?", "true_answer": "Bury St Edmunds"}
{"task_id": "262", "question": "What was the status of the diocese in the year following a visit by a visitor who was baptized in a Minor Basilica located within it, given that this diocese’s current bishop previously led a military ordinariate headquartered at the Field Cathedral of the Polish Army—with personal jurisdiction and reestablished after suppression during communist rule in Poland—and that the diocese has a minor basilica dedicated to the same figure to whom the Basilica of Saint Mary the New, commissioned by Justinian I and built in the 6th century, is dedicated?", "true_answer": "It was raised to the rank of Roman Catholic Archdiocese of Białystok"}
{"task_id": "263", "question": "In 1920, an athlete set the final world record in an event that was later replaced by the 400m hurdles, achieving a time of 54.2 seconds. What was the name of the significant achievement during this athlete's sporting career?", "true_answer": "He was an Olympic medalist"}
{"task_id": "264", "question": "\"What is the name of the flight that was hijacked in July 1968 by a Marxist-Leninist militant group, which also carried out an attack involving elementary school hostage-taking at Netiv Meir Elementary School resulting in multiple casualties?\"", "true_answer": "El Al Flight 426"}
{"task_id": "265", "question": "Which Texas governor, who established a bank first chartered west of the Mississippi River and led a period requiring the bringing of 500 families to vacant lands within existing colony limits, had what role in the militia?", "true_answer": "He was active in the militia in Chihuahua"}
{"task_id": "266", "question": "What is the birth year of the British scientist who founded an organization located in Glasgow that developed a control algorithm using inverse pendulum simulation for NASA's Space Shuttle landing system?", "true_answer": "1923"}
{"task_id": "267", "question": "At the 2005 Grand Slam mixed doubles tournament, which had final teams representing India, France, Australia, and Ukraine, a team consisting of two players defeated another team in the final. One player of the winning team had previously won a Grand Slam tennis tournament as part of the 2001 US Open, is the first national player from Zimbabwe competing in Men's Doubles, and had partnered with a player who partnered with Adil Shamasdin to win the 2017 Leon Challenger doubles title. The other player of the winning team partnered with another player and defeated a team composed of a player from Sweden and a player from the United States in the semifinals of the same tournament. What is the name of the team that was defeated by the winning team in the final of the 2005 Grand Slam mixed doubles tournament?", "true_answer": "Paul Hanley and Tatiana Perebiynis"}
{"task_id": "268", "question": "In 1961, the last Governor-General of a territory that had the Portuguese Indian escudo as its official currency and ended existence that year made a state visit to a Portuguese colony in Asia that was the site of the first Inquisition outside Europe in 1560. How was he received?", "true_answer": "He was given a warm reception"}
{"task_id": "269", "question": "Who is the person who pressured the Prime Minister of Belgium, who sought to abolish a law that allowed wealthy Belgians to substitute conscription via payment, and whose government collapsed due to an event that violated the Belgian Official Languages Act?", "true_answer": "Leopold II"}
{"task_id": "270", "question": "On 17 May 2004, an armed robbery occurred involving a stolen Cherokee Jeep and gold bullion. A Metropolitan Police unit prevented the theft of the gold bullion, recovered a sawn-off shotgun and revolver, arrested a suspect for the armed robbery using stun guns, and seized the stolen Cherokee Jeep. The gold bullion was at a location that was penalized £120,000 by a government regulatory authority for losing an unencrypted USB with personal data. The same authority also penalized Doorstep Dispensaree Ltd for exposing patient documents in unlocked containers with an initial fine of £275,000. What is the value of the gold bullion?", "true_answer": "£40 million"}
{"task_id": "271", "question": "Which squadron, based at a UK airfield that hosted the first night bombing trials in 1938, operated from April 1958 to March 1964 a unique V bomber with a crescent-shaped swept wing and compound-sweep design, distinctive in wing configuration among V bombers, and deployed the first UK thermonuclear weapon featuring a flat nose casing?", "true_answer": "No. 10 Squadron RAF"}
{"task_id": "272", "question": "A transport aircraft transporting a bulldozer to Antarctica crashed in Brazil in July 1968. How many people were onboard?", "true_answer": "10 people"}
{"task_id": "273", "question": "\"In which year did the English cricketer who played for Somerset, accumulated 10,342 first-class runs without ever scoring a century, was known for bowling left-arm leg-break, and held the record for the most first-class runs without a century, pass away?\"", "true_answer": "1995"}
{"task_id": "274", "question": "At an entrance that has doors depicting the evolution of mining, donated by the company that operated the Berkeley Pit in Butte, Montana and merged into ARCO, there is a statue depicting the founder of that company. What is the name of the artist who created this statue?", "true_answer": "Augustus Saint-Gaudens"}
{"task_id": "275", "question": "What is the name of the squadron that included a Cold War bomber—manufactured by Handley Page, part of the V bomber trio, and equipped with kneeling nose gear for missile carriage—which crashed during an airshow held at a location where it undershot the approach, whose nose section is now displayed in a World War II military museum housing one of seven remaining intact CG-4A military gliders, and was previously owned by someone who owned the Soplata Airplane Sanctuary that housed the B-52 Lucky Lady III cockpit section?", "true_answer": "No. 55 Squadron RAF"}
{"task_id": "276", "question": "At the championship held in Nairobi, Kenya in 2010 where Richard Mateelong won the 3000 metres steeplechase and set a championship record of 8:23.54, what was the time recorded in the 1 mile race in July 2010 by the Kenyan athlete who participated in the same championship, won the 1500 metres event, and set a championship record of 3:36.19?", "true_answer": "3:49.75"}
{"task_id": "277", "question": "What is the name of the newspaper that published reports on March 5 and March 25, 1976, which indirectly accused the Chinese Premier who served before 1976, whose 1975 administrative and economic reforms were criticized as capitalist, and whose reports were tied to an event triggered by the reversal of Zhou Enlai's 1975 administrative reforms, opposed a political faction that led to trials after Mao Zedong's death, culminating in public suppression after a gathering in Tiananmen Square, and who was indirectly labeled through a campaign that exploited his reforms, leading to his downfall and culminating in a trial after Mao Zedong's death in 1976?", "true_answer": "Wenhui Daily"}
{"task_id": "278", "question": "What is the birth year of the Canadian wrestler who held a women's wrestling title that was unified with the All Pacific Championship and is part of IWA, and who is affiliated with a Canadian wrestling promotion based in Calgary that experienced the 1983 riot at Ogden Auditorium?", "true_answer": "1961"}
{"task_id": "279", "question": "What is the title of the poem written in 1995 by an author who co-authored with a person who co-authored the 2015 paper titled \"Multilingual Miami: Current trends in sociolinguistic research\" with Andrew Lynch; whose book covers topics including historical forces, political influence, and language distribution, donates its profits to an organization that funds a project focusing on documenting the Miami-Illinois language supported by the Miami Tribe of Oklahoma, and serves as a foundational reference for the aforementioned paper?", "true_answer": "Carolina Sonnet"}
{"task_id": "280", "question": "\"Where did the funeral procession, which occurred in July 1904 and commemorated a naturalist who died in the same month, take place? This naturalist worked at the Museo de Historia Natural de Valparaíso, co-founded an entity established in 1897 and first published by the same museum, and had a plant genus in the Caryophyllaceae family named after him by Carlos Luigi Spegazzini.\"", "true_answer": "Santiago, Chile"}
{"task_id": "281", "question": "An individual who had a hideout at Ben Hall's Cave and at another location in the Northern Territory—later becoming Australia's first savanna burning carbon offset project employing Indigenous traditional fire management—led a gang that committed the Eugowra gold escort robbery, the largest gold heist in Australian history. An associate who operated the hideout at that Northern Territory site provided refuge to the gang. Together, how did these two individuals obtain meat for their business?", "true_answer": "From stolen livestock"}
{"task_id": "282", "question": "Is the boxed set, which is part of a book series dedicated to residential architecture about a work by an architect known for pioneering modernist architecture in Sydney, that documents this architect's works (including the featured work), with an introduction by Chris Abel, still in print?", "true_answer": "No, it is out of print"}
{"task_id": "283", "question": "\"In a One-Day International cricket match between two teams, where both teams scored over 250 runs and the match ended in a tie, one team recovered from a score of 33 for 5. The match took place at the same venue where Graeme Smith scored 259 in a Test match. How did the team that recovered from 33 for 5 tie the match?\"", "true_answer": "England scored two leg byes off the last ball"}
{"task_id": "284", "question": "What is the name of the entity that claimed responsibility for a separatist IED ambush resulting in the killing of a Cameroonian soldier, which occurred near the capital of a region in Cameroon that contains a UNESCO World Heritage Site—a national park protecting the Cross River Gorilla?", "true_answer": "The Ambazonia Defence Forces (ADF)"}
{"task_id": "285", "question": "What is the title of the song released in 1945 by the person who directed a film released in 1936 that is part of the Golden Age of Argentine cinema and features the song \"Mi Buenos Aires Querido\"?", "true_answer": "La Canción de Buenos Aires"}
{"task_id": "286", "question": "In July 2011, a UEFA Europa League qualifier match involving clubs from Armenia and Hungary was held at a stadium where, in 1998, a UEFA Champions League qualifier match involving clubs from Armenia and Finland also took place. What was the final score of the 2011 match?", "true_answer": "Ferencvárosi TC won 2-0 in the match, and 5-0 on aggregate"}
{"task_id": "287", "question": "What was the birth year of the person who became the Patriarch of the city that was besieged by Thomas the Slav, defended with Greek Fire in 821-822, and later served as the capital under the Palaiologos dynasty; who was supported in his election by a government that lasted from 1945-1953; and who was transported via the personal aircraft of the President of the United States?", "true_answer": "1886"}
{"task_id": "288", "question": "What is the profession of the person who was born in 1929, operated a fruit shop and milk bar, and gave a portrait to someone known as the 'Extremely Cute Wrestler' who co-owns Pop Roc?", "true_answer": "Boxer"}
{"task_id": "289", "question": "What is the name of the position held by a person who was born in Mexico, immigrated to the United States at less than 2 years old, and represents a district that had redistricting maps approved by the Colorado Supreme Court in 2021, effective in 2022?", "true_answer": "Carlos Barron is a Colorado State Representative, serving from 2025 to the present"}
{"task_id": "290", "question": "\"Until what year did the guidebook, authored by the translator of the first work that systematically classified sciences into a hierarchical structure from mathematics to sociology and established the foundation of Auguste Comte's positivist philosophy, remain in common usage?\"", "true_answer": "1880"}
{"task_id": "291", "question": "Who defeated, in a darts match in July 2010 that included players selected as wildcards by a British sports broadcaster, the second-selected player who was not in the PDC top six and participated in the event?", "true_answer": "Mark Webster"}
{"task_id": "292", "question": "Who is the first Latino in the United States Congress, elected in 1877 from a state that required congressional intervention to resolve conflicting electoral certificates, whose seat was contested in the Congress that resolved the disputed presidential election between Rutherford B. Hayes and Samuel J. Tilden, held a special session starting on October 15, 1877, passed the Bland-Allison Act, and was the first to install an electric lighting system in the United States Capitol?", "true_answer": "Romualdo Pacheco"}
{"task_id": "293", "question": "What is the name of the eparchy led by a bishop who launched an initiative of CEADOM focusing on student talents and Malayalam proficiency, which is part of a program organized by NaITER focusing on trainer certification and was launched via an online platform?", "true_answer": "Syro-Malabar Catholic Eparchy of Mananthavady"}
{"task_id": "294", "question": "What is the title of the textbook that provides the history of a U.S. state, covering the time period before 1900, including the event before 1847 when William B. Ide led the establishment of the California Republic in that state?", "true_answer": "Competing Visions: A History of California"}
{"task_id": "295", "question": "What was the duration of the brief relationship between the French composer who first conducted a major orchestra outside Europe in the 19th century, pioneered orchestration techniques through a treatise, and the person he met at a cemetery built on a mass grave from the French Revolution, given that he discovered this person's death through a grave and composed a work that premiered in 1837, commissioned to commemorate an event involving French soldiers' deaths during the Algerian Campaign of 1830?", "true_answer": "Less than a year"}
{"task_id": "296", "question": "What is the name of the radical coterie that supported a political figure who orchestrated an event in 1965 following the Five-Antis Campaign of 1964, which targeted Shanghai literary figures?", "true_answer": "The Gang of Four"}
{"task_id": "297", "question": "Who was the governor of Indiana during the early 1820s, advocated for the extension of a project whose first covered bridge spanned the Whitewater River Gorge and modernization began in Indianapolis in 1828 (with its first covered bridge built in the 1830s), presided over the establishment of the Grand Lodge of Indiana in 1818, held a specific title, and did not serve a third term due to a reason tied to that title?", "true_answer": "He declined reelection in 1825"}
{"task_id": "298", "question": "What is the name of the orchestra that is mentioned in the title of a 2016 orchestral work featuring a composition that is part of the work, which originated as a WWII Japanese military song from Rabaul, composed by an individual who authored the 1938 publication \"Becoming a Popular Music Composer: Easy Methods to Write Popular Songs\" and died in the Battle of Iwo Jima?", "true_answer": "Golden Orchestra"}
{"task_id": "299", "question": "Which notable person, who was a member of parliament and government minister, chose to retire to or have a second home in a place that has a landmark displaying a book bound in human skin and a 12th-century sword that has inscriptions 'SES BENEDIC TAS and + I NOMINE DOMINE' and was involved in a conflict between King Henry II and his son, has name ?", "true_answer": "Lord Tebbit"}
{"task_id": "300", "question": "What is the profession of a person born in 1945 who authored a work published before 1997, set in post-apocalyptic North America, featuring the U.S. Postal Service uniform as a central symbol, exploring the theme of restoration of civil institutions, and not based on Arthurian legend?", "true_answer": "Author and screenwriter"}
{"task_id": "301", "question": "What is the name of the person who provided financial help for the construction of an enclosure that was the first to enclose a medieval walled city established during the Carolingian period with an area of 20 hectares beyond the Roman walls in Genoa? This enclosure, constructed under a period in the 10th century and authorized by a legal document granted by a king of Italy, included a gate that is the only remaining example of an architectural style characteristic of medieval defensive gates with stonework dated to the 10th century.", "true_answer": "The Carolingians"}
{"task_id": "302", "question": "An open letter serves as an accusation about an ideology known as the Three Represents, introduced by a leader of China who held the position of General Secretary of the Communist Party of China and who also introduced the Going Global policy in 1999 to develop national champion firms targeting the Global South. This ideology, which emphasizes advanced productive forces, underpins a CCP membership expansion policy introduced in 2001 that targets private entrepreneurs and categorizes them as part of a new social strata. The open letter, authored and made by a Marxist theorist and conservative critic who opposed that ideology, also criticizes this membership expansion policy. What is the content of this open letter?", "true_answer": "Betrayal of 'true' communist ideology"}
{"task_id": "303", "question": "What is the name of the series that is the first television dramatization of an Underground Railroad conductor who led an operation conducted using John Adams, Harriet A. Weed, and Sentinel, which freed over 700 enslaved people?", "true_answer": "The Great Adventure"}
{"task_id": "304", "question": "What is the name of the company that is a publishing company, published a book that is a book providing a complete history, was first published in 2016, analyzes counter-decision making processes, and focuses on a decision that was made in 2015, overrode the 1968 Roskill Report's STOL/VTOL recommendation, concerns the Heathrow third runway expansion, and resulted from the UK Airports Commission deliberation?", "true_answer": "ICE Publishing"}
{"task_id": "305", "question": "What is the name of the athlete who came in second place at the women's 10,000m event in 2011 where the bronze medalist was an Indian athlete who holds the national record for the women's 10,000m achieved during the 2010 Guangzhou Asian Games?", "true_answer": "Kareema Saleh Jasim"}
{"task_id": "306", "question": "What is the publisher of the 1950 philosophical analysis that analyzes Josiah Royce's concept of the Social Infinite, links to the Community of Interpretation theory, and was written by a 20th-century American philosopher (who taught at Yale University, proposed the Ethical Communalism theory, and has a publication year in the 1960s)?", "true_answer": "Liberal Arts Press"}
{"task_id": "307", "question": "What is the name of the company that, in 1950, moved to a location named after a ship that participated in a 1939 naval battle—the first instance where radar was used by both sides—involving an organization that was the first to implement BioFiltration 2.0 and participated in the CleanWater Initiative, leading to the establishment of a sewerage authority established before 1970, which was involved in the Hoey Pump Station Improvements Project aiming to boost operational efficiency and lower energy use?", "true_answer": "Fisher and Ludlow"}
{"task_id": "308", "question": "What are the names of the buildings that are the focus of a lecture film released in 1993, created by an architect who designed a modernist residence completed in the mid-1960s, located in the same place as a residence designed by Ken Woolley, built on a steep rocky slope with a creek, featuring cantilevered terraces and reinforced concrete construction, and heritage-listed in 2008? The residence designed by Ken Woolley exemplifies the Late Twentieth-Century Sydney Regional architectural style, uses timber post-and-beam and exposed brickwork, integrates split-level design with natural terrain, and is heritage-listed for its association with the Sydney School architectural movement.", "true_answer": "Hong Kong Club and Capita Centre"}
{"task_id": "309", "question": "Who is the tennis player who defeated a Swedish tennis player, who won two ATP titles in 1997 including an ATP tournament held on indoor carpet in 1997 that he won, in the completion of the suspended Gentlemen's semifinal in July 2005?", "true_answer": "Andy Roddick"}
{"task_id": "310", "question": "What is the volume number and issue number of the article authored by the person who compiled the Biographical Dictionary of Enslaved Black People in the Maritimes, which focuses on enslaved individuals in the 18th-century Maritimes? This article analyzes a document that was published in the Nova Scotia Gazette, was analyzed in a legal study on 18th-century enslavement practices in Nova Scotia, is included in the Nova Scotia Archives' 2019 digital exhibit on early Black history, and documents an example of early colonial runaway advertisements. It also examines a case documented in Halifax Gazette microfilm 8152 page 2, published on May 30, 1752, which involves enslaved individuals imported from the West Indies, was conducted by Joshua Mauger, and took place in Halifax. The article is published in a peer-reviewed academic journal that collaborated on digitizing records including shipping logs from Halifax port between 1730 and 1820, which document trade routes between Nova Scotia and French ports like Bordeaux. The journal focuses on historical records of the Atlantic region and uses digital preservation techniques for primary sources.", "true_answer": "Volume 46, Issue 1"}
{"task_id": "311", "question": "In which year was an episode of a series directed, given that the episode was directed by the same director who directed \"Fools' Parade\" (also known as \"Dynamite Man from Glory Jail\") featuring James Stewart; this episode features three cast members who frequently appeared in John Wayne films; the series has another episode, also directed by the same director, which features a cast member from \"The Covered Wagon (1923)\"—a film directed by James Cruze and based on Emerson Hough's novel; this cast member appeared in films directed by a director who directed a film featuring John Wayne and Walter Brennan that is based on Eugene O'Neill's plays; the director of the episodes also directed a film based on Francis Parkman's nonfiction work that differs from \"The Covered Wagon (1923)\"?", "true_answer": "1962"}
{"task_id": "312", "question": "What is the name of the journal that published a case study on an entity that practiced unethical use of goat gland implants and faced a lawsuit from a medical professional organization accused of conspiring to restrict chiropractic practice, which was a defendant in an antitrust lawsuit led by Chester Wilk, who led the plaintiffs in an antitrust case against that organization?", "true_answer": "Kansas Journal of Sociology"}
{"task_id": "313", "question": "What is the name of the actor who was depicted in two portraits—one created by an artist who lobbied for the first copyright law granting protections for engraved works (which provides exclusive rights to engravers and does not require registration at Stationers' Hall), and the other painted by an artist who sued an engraver for reproducing it; this engraver also painted a portrait of Isaac Newton that was engraved as the frontispiece in the 1726 edition of Principia?", "true_answer": "Garrick"}
{"task_id": "314", "question": "What are the names of the city and studio where an album recorded in 1954 was recorded, the album that contains a guajira track which premiered in 1937 and appeared in a 1947 Cuban film, composed by a musician who was active in the 1930s, used radio, popularized guajira, and created a musical style that appeared in the same film?", "true_answer": "New York, Webster Hall Studios"}
{"task_id": "315", "question": "What year was the Spanish physicist and academic, who is the director of a Max Planck Society institution with unique facilities for nanoscale synthesis and quantum materials spectroscopy and conducts research on high-temperature superconductors, and who specializes in Raman scattering on high-temperature superconductors, born?", "true_answer": "1934"}
{"task_id": "316", "question": "What is the name of the significant event that occurred on the evening of April 13, 1834, which took place in a location that was the site of a massacre in 1834 at building number 12 on Rue Transnonain (now Rue Beaubourg) as retaliation for a sniper killing an infantry captain? This location was depicted in an artwork published by Aubert and printed by Nicolas Louis Delaunois, which depicts government-led violent suppression.", "true_answer": "Barricades were set up, leading to harsh repression and a massacre of a house's inhabitants"}
{"task_id": "317", "question": "In which year was an article discussing the conversion of hydrous germanium(II) oxide to germynyl sesquioxide, authored by a researcher who has authored a theoretical study on electron scattering by a single barium ion in a solid and a study on σ-Methyl-π-Cyclopentadienylmolybdenum Tricarbonyl, and who has accomplishments including co-authoring a 2011 study on germanium nanodevices, investigating surface passivation techniques for semiconductor performance, and collaborating with industry partners, published in a journal that was first published in 1962 and in its first year had four issues, 185 articles, and totaled 977 pages?", "true_answer": "1977"}
{"task_id": "318", "question": "What is the title of the album released in 1982 by an artist who played bass for another artist, recorded an album with an intimate kitchen-like atmosphere in Dublin, and collaborated with a flautist from Limerick who released \"The Temple in the Glen\"?", "true_answer": "Art of Control"}
{"task_id": "319", "question": "During the 2003 Iraq crisis, which involved weapons of mass destruction and was mistakenly associated with aluminum tubes used for uranium enrichment (part of U.S. pre-war intelligence claims), the government of Belgium proposed a solution to this issue. This same government, which was the government of Belgium, also proposed another initiative that was rejected in referendums by France and the Netherlands but ratified without public referendum via Belgian parliamentary approvals. This initiative was part of a project that started as the European Constitutional Project in 2001 and resulted in the Treaty of Lisbon. What is the solution proposed by the government of Belgium to the issue during the 2003 Iraq crisis?", "true_answer": "A diplomatic solution"}
{"task_id": "320", "question": "What is the name of the company that made a guitar between 1965 and 1967, which became the signature guitar for an owner of a 1943-produced instrument with an Adirondack spruce top, Brazilian rosewood back/sides, one of only 24 units made that year, donated to an institution housing a harpsichord originally owned by Queen Charlotte?", "true_answer": "Ovation Guitar Company"}
{"task_id": "321", "question": "An English cricketer who played for the governing body for cricket in the West Indies (which continued until the establishment of the West Indies Cricket Board in 1923), served as a military captain, and died in a battle during the Napoleonic Wars involving the 48th Regiment of Foot that captured a French eagle, was born in what year?", "true_answer": "1772"}
{"task_id": "322", "question": "What was protested against by University of Texas students in Austin during the early 1960s, who organized protests using the tactic of stand-ins to integrate certain venues, leading to a 1960 event where a prank was used to integrate these venues?", "true_answer": "Students staged demonstrations against segregated lunch counters, restaurants, and movie theaters"}
{"task_id": "323", "question": "Who is the musician who wrote and recorded a song that is a tribute to a 12-string guitar innovator who pioneered integrated concerts in the 1940s and was the first African American to perform at the White House in 1941? The song was produced by someone who signed their first music publishing deal at age 13 and released an album at age 18; it was first recorded by an artist who topped the Adult Contemporary charts and achieved success with soul ballads. The song was performed live at an event in 1991 that hosted a performance by Jazz Futures, which included Roy Hargrove and Christian McBride. The tribute's subject released \"Southern Exposure\" in 1941, which critiques Jim Crow laws.", "true_answer": "Jack Williams"}
{"task_id": "324", "question": "What is the name of the city where a person who participated in the second literary project lived and collaborated with the author of \"Scammer,\" which is a rebuttal to Natalie Beach's essay?", "true_answer": "New York City"}
{"task_id": "325", "question": "What was the finishing position of the driver who set the NASCAR Cup Series record for consecutive finishes without DNF in 2014, surpassing the previous record held by Herman Beam, and who was involved in a lawsuit in 2015 involving hidden cameras installed in bathroom areas targeting him, in the NASCAR race that made the team owner, who became the first in 2010 to have drivers win the Daytona 500, Indianapolis 500, and that race in the same season?", "true_answer": "Third"}
{"task_id": "326", "question": "How many points did the Swiss rider have after 7 of 17 rounds in July 2010, who achieved a podium finish and participated in the crash-filled Moto2 race won by Yuki Takahashi, which was the first victory for the Tech 3 Moto2 team?", "true_answer": "94 points"}
{"task_id": "327", "question": "What is the number of pages in the trade paperback of the team known for incompetence, whose members are the children of a World War II-era superhero team originating from Standard Comics, whose members parody Justice League or Society members?", "true_answer": "144 pages"}
{"task_id": "328", "question": "What is the page range of the article about Mexican rural history, authored by a historian who studied rural hacienda systems in western Mexico and co-edited a work that examines comparative regional development in Mexico, which is part of the US-Mexico Contemporary Perspectives Series?", "true_answer": "5–61"}
{"task_id": "329", "question": "What is the name of the action taken by a French monarch, who was assassinated in 1610 by a former mayor's clerk claiming divine inspiration and executed by being torn by horses, which prevented a negotiation at a river flowing through Switzerland and Germany that has a waterfall formed by glacial erosion during the last ice age and located near Neuhausen am Rheinfall?", "true_answer": "He sent troops to the Rhine to prevent the negotiations"}
{"task_id": "330", "question": "At what age did the British activist who restored manuscripts for the Victorian art critic who was the defendant in the 1878 libel case regarding \"Nocturne in Black and Gold\" brought by James McNeill Whistler, and who reopened and managed The Old Vic as a temperance hall since 1880 onwards, die in July 1912?", "true_answer": "Emma Cons was a 74-year-old British activist and early promoter of women's suffrage, and theater manager of The Old Vic in London"}
{"task_id": "331", "question": "What is the name of the significant event that occurred in September 1982, which led to the entry into the Central Committee in 1982 of a person who held the position of Vice Chairman of the State Administration Commission on Import Export Affairs during 1980 and led an expert team in the construction of a factory in Romania in 1971? This entry was preceded by the appointment of this person as vice minister of the electronics industry, which also occurred in 1982.", "true_answer": "The 12th National Congress of the Chinese Communist Party"}
{"task_id": "332", "question": "What is the name of the university where a law professor teaches who served as a law clerk under Justice John Paul Stevens, is a member of an organization led by Mark Geistfeld of NYU School of Law that launched a project on civil liability for artificial intelligence in 2023, and authored a legal analysis applying United States exclusionary doctrine to Iraqi interrogation laws under the post-2003 democratic transition, published in a peer-reviewed constitutional law journal?", "true_answer": "University of Oklahoma"}
{"task_id": "333", "question": "What is the name of the cyclist who finished second in stage number 2 of the Tour de France, which involved a crash with Lance Armstrong and Alberto Contador, had a peloton delay, and was won by a rider who holds the record for most Tour de France participations with a total of 18 and who participated in all 2015 Grand Tours?", "true_answer": "Maxime Bouet"}
{"task_id": "334", "question": "What is the name of the university press that published a book authored by Dwayne A. Tunstall about a philosopher who presented seven novel ideas in their final teachings? This philosopher's final seminar is documented in a book titled \"Metaphysics,\" which was edited by two philosophers. One of these philosophers authored an essay titled \"The Polarity of Dialectical History and Process Cosmology\" and discussed the restoration of philosophical theology through dialectical methods. The other philosopher co-edited \"Metaphysics\" with William Ernest Hocking but excluded Richard Hocking. Both editors are philosophers.", "true_answer": "Fordham University Press"}
{"task_id": "335", "question": "What is the name of the team that was defeated by a team, which participated in a tournament in 1993 that had Sinval as top scorer, in the last round of the 2009 Brazilian Championship to secure a place in the 2010 A Series, and that team later won the final against a team which defeated Nacional and participated in the 2010 Uruguayan Primera División playoff final?", "true_answer": "Palmeiras"}
{"task_id": "336", "question": "What role did the striker, born at an English football club that was the first to reach 1000 goals in each of the top four tiers by 2005, who won an award first presented in the 2004-05 season with the first recipient being Steve Howard during January 2014 while playing for an English football club reformed in 1934 to continue the now-defunct Peterborough & Fletton United F.C., have at an English football club whose stadium has been in continuous use since 1904?", "true_answer": "Coach"}
{"task_id": "337", "question": "What is the name of the military service whose general commanded forces with numerical superiority over his opponent, abandoned a strategically defensible position during a battle and died in a counterattack at that battle, and who commanded a military detachment belonging to the 2nd Siberian Army Corps that suffered a decisive defeat at the Battle of Yalu River?", "true_answer": "Imperial Russian Army"}
{"task_id": "338", "question": "Consider a symphony mentioned as an exception. It was composed by a certain composer who also created another symphony containing a second movement. That second movement is a movement in A minor that begins with a cello and viola melody, inspires a 1908 ballet by Isadora Duncan, employs a 6/8 funeral march rhythm, and is structured in poetic verse variations. It was encored at an event held for supporting soldiers wounded in the Battle of Hanau, which likewise featured that same movement with its 6/8 funeral march rhythm and also inspired the 1908 ballet by Isadora Duncan. What is the name of this exception symphony?", "true_answer": "Symphony No. 9"}
{"task_id": "339", "question": "Who is the U.S. president who, accompanied by another individual, was the first to visit a city in Texas that was the first to use a National Historic Landmark, which is the only surviving example of 19th-century municipally owned carbon-arc lighting systems? Provide the names of both the president and his companion.", "true_answer": "William McKinley, accompanied by Texas governor Joseph D. Sayers"}
{"task_id": "340", "question": "What is the name of the city where the 8th edition toxicology textbook that focuses on environmental xenobiotics, includes case studies from developing nations, employs visual explanations for metabolic pathways of toxicants, and introduces a new feature was published?", "true_answer": "New York"}
{"task_id": "341", "question": "Is the definitive monograph, co-authored by the curator of the European Architecture. 1984-1994 exhibition and an author who wrote an essay analyzing Rose Seidler House as a yardstick for Modern Australian architecture and who appears in \"Architecture, Technology and Progress (2004)\" edited by Chris Abel, which documents the career of the architect who designed Rose Seidler House, submitted an entry to the 1956 Sydney Opera House design competition, and later designed Australia Square Tower, still in print?", "true_answer": "No, it is out of print"}
{"task_id": "342", "question": "\"In which year did the event occur that demolished part of the park, which was part of the park, and created a piazza and a street located in Genoa, Italy? Both the piazza and the street were established during the same period. The street was constructed during the existence of the Ligurian Republic, established under French rule, and was part of urban reforms led by the French administration. The street was later renamed to Via Assarotti after the founder of an educational institution for the deaf in Genoa established in 1911.\"", "true_answer": "1877"}
{"task_id": "343", "question": "In what year did the sale occur in which a manor—with a recorded population of 55 households in 1086, located in an area formed in the 12th century by merging Loxley Hundred and Ringoldsway Hundred—was sold by the first translator into English of an ancient geometry text whose first Greek edition was edited by Simon Grynaeus and published in 1533, and who also held the title of the official responsible for organizing a 1616 event featuring a \"King of Moors\" pageant with racialized tropes involving blackface and gold symbolism; this manor was recorded in the 11th-century government record known as the Little Domesday volume, which includes details on landholdings and livestock in Essex and was commissioned by William the Conqueror?", "true_answer": "1569"}
{"task_id": "344", "question": "\"What is the name of the legislative body where an individual served from 1998 to 2002, who also served as Director of an organization that oversees 36 regulatory entities (boards, bureaus, etc.), licenses over 2.8 million professionals, operates a complaint resolution program available in over 200 languages including American Sign Language, and who later became Chair of an agency that operates Lawrence Livermore National Laboratory managed by a consortium including the University of California, Bechtel National, Inc., and BWX Technologies Inc.?\"", "true_answer": "California State Assembly"}
{"task_id": "345", "question": "What is the name of the person who is the daughter of two individuals—one who initiated a campaign that targeted sparrows, causing a surge in locust populations and leading to crop failures during the 1950s in China, and another who oversaw a film division adapting eight model operas into cinematic versions under the Central Cultural Revolution Group?", "true_answer": "Li Na"}
{"task_id": "346", "question": "Who was the highly respected individual in Chinese society who died in January 1976 and was second only in influence to a leader who led a movement initiated by the Chinese Communist Party that addressed the issue of dogmatism and criticized the group known as the 28 Bolsheviks?", "true_answer": "Zhou Enlai"}
{"task_id": "347", "question": "Who was the mayor of the city that hosts the oldest food fair in Piedmont, which hosts the Truffle of the Year Award, and who held office during the first satellite phone call on July 26, 1962, between that city and the city associated with the first doctor in Oregon who used antitoxin to treat diphtheria, which was enabled by the first communications satellite using traveling wave tube amplifier and was part of the first transatlantic telecommunications milestone?", "true_answer": "Osvaldo Cagnasso"}
{"task_id": "348", "question": "What country is the wooden long church constructed in 1888, which retains the interlocking timber technique of a medieval stave church and is built on the original site of a medieval stave church, located in?", "true_answer": "Norway"}
{"task_id": "349", "question": "\"What is the name of the city where a work published in 1927, discussing Harriet Martineau's contributions to sociology, authored by a person who served as secretary to Henry James, used a Remington typewriter, and authored the 'Henry James at Work' memoir, was published, considering that this work is part of the first book analyzing Harriet Martineau's sociological theories, which applies to colonial economic structures and was published before 1930, and was published by a publisher who also published 'The Elizabethan Home'?\"", "true_answer": "London"}
{"task_id": "350", "question": "Were any injuries reported in the aviation incident classified as causing substantial damage that occurred on July 12, 2013, at the same location where a 2008 incident involving a Boeing 777-200ER resulted in a crash landing short of the runway due to fuel starvation from ice in fuel/oil heat exchangers? The 2013 incident involved a commercial jetliner with over 50% composite materials by weight—the first aircraft to utilize this design—operated by the first African airline to operate Boeing 767-200ER aircraft. A fire originated in a component identified in FAA SAIB HQ-12-32 in the aft cargo compartment while the aircraft was parked, unpowered, and unoccupied.", "true_answer": "No injuries were reported"}
{"task_id": "351", "question": "What is the name of the person who was elected as the individual whose term started in 1877, introduced eight bills focusing on constituent services including land claims and pension relief for militia members, and represented a region that granted pension relief to militia members, addressed Apache conflicts, and was part of a country that later became part of the United States?", "true_answer": "Trinidad Romero"}
{"task_id": "352", "question": "What is the date of the discovery event involving uranium metal that took place at an airport, where a package originating from Pakistan and destined for Iran, containing metal bars contaminated with uranium, was processed, resulting in an arrest under terrorism laws?", "true_answer": "29 December 2022"}
{"task_id": "353", "question": "After France and Spain signed a treaty that ended the Italian Wars and required Emmanuel Philibert of Savoy to renounce his claim to Portugal's throne, the French crown and French negotiators issued a directive that complied with the terms of this treaty. This directive, given by the Constable of France, required the Grand Master of Artillery—who had replaced his predecessor, leader of the Black Bands of Giovanni—to reduce military forces and dismantle fortifications, including overseeing the dismantling of a fortress that later became the prison of the Man in the Iron Mask. How did the Grand Master of Artillery feel about this directive?", "true_answer": "Brissac greatly resented the order"}
{"task_id": "354", "question": "In what year did the place located in Sicily, which produces saffron and historically had a major industry of sulfur mining during the 19th century, become an episcopal see?", "true_answer": "1844"}
{"task_id": "355", "question": "What is the name of the group that agreed to a truce with a military force in July 1912, where that military force, aiming to counter Russian expansion, participated in an event between 1911 and 1912 involving Persia and the Ottoman Empire, with the objective of establishing the Iran-Ottoman boundary and which led to the first meeting of the Turco-Persian Commission in March 1912?", "true_answer": "Albanian rebels"}
{"task_id": "356", "question": "When was the first baseman born who achieved 6 hits in a single game that occurred on June 6, 1934, which was played by a team managed by Joe McCarthy?", "true_answer": "1908"}
{"task_id": "357", "question": "An American soccer player who played as a forward for the University of Washington, participated in the FIFA Futsal World Cup hosted in Brazil with 20 participants, and is a member of a national team that won a silver medal in the 2021 CONCACAF Futsal Championship hosted in Guatemala—what year was he born?", "true_answer": "1983"}
{"task_id": "358", "question": "What was the method of victory in the July 2010 welterweight bout, held in the largest major city without a navigable waterway in the U.S., where the fighter who is the first UFC fighter to win all three post-fight bonuses (Fight, Knockout, Submission of the Night) and who is a firefighter defended his boxing title against his opponent?", "true_answer": "By submission (armbar)"}
{"task_id": "359", "question": "How many vice-governors did the military governor term of the first military governor of a province whose former capital is part of the Zamboanga Peninsula region, who served as Brigade Commander of a Philippine Scouts unit that participated in World War II, has a permanent memorial in the Zamboanga Peninsula, and is currently designated as a military brigade, have?", "true_answer": "Three"}
{"task_id": "360", "question": "A match occurred in July 2006 in Latvia featuring a Faroese football club that was the first Faroese team to participate in UEFA competition qualifiers and a Latvian football club; the Faroese club also took part in a football competition that included this match. What was the aggregate score of that match?", "true_answer": "1–4"}
{"task_id": "361", "question": "In late 1933, a person became Prime Minister of Romania and had a premonition when he took office. He outlawed and cracked down on a group that had splintered from the National-Christian Defense League and was banned by Decree 281 enacted in late 1933. A deputy minister, who served in the Prime Minister's cabinet and enforced Decree 3438/1940 mandating the exclusion of Jews from the Romanian education system, recorded something about the Prime Minister's premonition. What did the deputy minister record about the Prime Minister's premonition?", "true_answer": "Streitman recorded Duca's premonition that he would end up being assassinated by the Iron Guard"}
{"task_id": "362", "question": "What is the name of the person who collaborated with Alex Saum-Pascual, who founded Hispanism that originated in Norway, on a translation of Don Quixote, which was analyzed in a work discussing borealism, authored by someone who co-authored with Alex Saum-Pascual, analyzes digital cultural practices in Spanish culture, and published in the Journal of Spanish Cultural Studies, and presented at the first conference on borealism in Spanish Golden Age literature that features analysis of Don Quixote translation?", "true_answer": "Nils Kjær"}
{"task_id": "363", "question": "Who won the silver medal in an event with a winning throw distance of 62.27 meters, which was part of a championship where eight championship records were equalled or beaten, held at a venue that hosted the 2024 Kobe Para Championships, which featured a world record in men's javelin throw F41?", "true_answer": "Vikas Gowda"}
{"task_id": "364", "question": "\"Which journal published the article named after a question that asks to identify metalloid components in semiconductor materials, the question being posed in a study that examines gallium arsenide alloys, investigates substitutional solubility of antimony, demonstrates type II band lineup in quantum dots, and modifies bandgap energy through substitution?\"", "true_answer": "Journal of Chemical Education"}
{"task_id": "365", "question": "What year did the American actor, who voiced a survivor of a planet devoured by Unicron (appearing in *The Transformers: The Movie* (1986), executed by Sharkticons after sharing information about Unicron's threat), die? This actor portrayed the title role in a Vincent Sherman-directed film based on Meyer Levin's novel, where the mentally challenged protagonist named Andy co-starred with Debbie Reynolds.", "true_answer": "2012"}
{"task_id": "366", "question": "Name the driver who finished second in a race where the winner was a driver who had finished second and experienced a radio malfunction in the 2025 IndyCar Season Opener at St. Petersburg, which was won by Alex Palou. This race also involved a driver with four Indianapolis 500 wins, who competed in the 2025 Daytona 500 and was penalized for blocking during the final restart.", "true_answer": "Will Power"}
{"task_id": "367", "question": "What is the location of the United Nations Information Centre that serves India and Bhutan, partners with an organization that partners with SoCalGas, has an initiative called \"community garden,\" promotes environmental sustainability, and co-organizes a film festival that is in its 20th edition, received over 200 entries, and includes countries Iran, Russia, Argentina, Israel, and Poland?", "true_answer": "New Delhi"}
{"task_id": "368", "question": "What is the number of pages of the second volume that is part of a work set in 1993, exploring the theme of family secrets, and is itself part of a larger work authored by the same author, which combines the genres of magical realism and family drama, explores family dysfunction across generations, is set in a vanishing Canadian factory town, and avoids overt supernatural plots?", "true_answer": "128 pages"}
{"task_id": "369", "question": "What was the duration of the rebellion that ended in 1912 and occurred in the same place as the 1860 rebellion led by the Topass community, which opposed Portuguese taxation policies and blended cultural elements of Timorese and Portuguese?", "true_answer": "1911–1912"}
{"task_id": "370", "question": "Where was the person who lobbied for approval of a scaled-down implosion test that was the first experiment to measure the dispersal of plutonium via high-explosive tubing, and who also directed another test that used a neutron initiator nicknamed \"Urchin\" and was the first nuclear test, born?", "true_answer": "Cooperstown, New York"}
{"task_id": "371", "question": "What is the name of the type of clothing depicted in the frontispiece of a book written by Sarah H. Bradford, where the frontispiece, created by a British artist, depicts the subject of the book?", "true_answer": "Civil War clothing"}
{"task_id": "372", "question": "\"At a public aviation exhibition featuring a plane used for maritime radar reconnaissance missions, which is one of the only surviving Handley Page Victor K.2 tankers in taxiable condition and equipped with Rolls-Royce Conway engines, an event occurred involving the plane during which something happened to the plane. What happened to the plane during this event?\"", "true_answer": "It inadvertently left the ground briefly"}
{"task_id": "373", "question": "What is the name of the band that shares its name with a show performed in 1977 featuring that band, which has a children's poetry collection published in 1984 by Faber & Faber, illustrated by Graham Percy, with the theme of Christian teachings through animal characters, and was dramatised by an author who wrote the children's book \"Osric the Extraordinary Owl\" published in 2021 and illustrated by Pauline Baynes?", "true_answer": "Captain Beaky and His Band"}
{"task_id": "374", "question": "What is the birth year of the Irish motorcycle racer who died in 1993, raced with the motorcycle brand that produced the motorcycle that won the twin-cylinder class at the 1907 Isle of Man TT using an engine from Peugeot, and was first inducted into the Irish sports hall of fame in 1960, which had Pat Callaghan as its first inductee?", "true_answer": "1903"}
{"task_id": "375", "question": "What is the type of service provided by an organization, previously known as 'The Ackers' and registered as a charity in 1983, located in the same place as the oldest assay office in the United Kingdom established in 1773, offered through a facility it established that is located on a former coal transportation canal basin site and offers tobogganing on a 100-meter slope?", "true_answer": "Outdoor activities"}
{"task_id": "376", "question": "\"During the 2010 UEFA Europa League, a football team participated and won a match in July 2010 against a team based in Zeta Municipality, which plays in a Montenegrin league located in Montenegro, sponsored by T-Com, with FK Mogren Budva as the champion in the 2010-2011 season, and each team playing 36 matches. The match was hosted at a stadium that also hosted a UEFA Euro 2012 qualifying match between the Moldova national football team and the Netherlands national football team on October 8, 2010. By what method did the football team win the match?\"", "true_answer": "Dacia won on away goals rule"}
{"task_id": "377", "question": "In 1967, an around-the-world flight was started by a person who flew an aircraft powered by Pratt & Whitney R-985 engines along an eastward equatorial circumnavigation route first attempted by Amelia Earhart in 1937. During this flight, the person dropped a wreath at an island claimed by the American Guano Company under the Guano Act of 1856, which later became part of the Pacific Remote Islands Marine National Monument established in 2009. What was the start date of this flight?", "true_answer": "June 9, 1967"}
{"task_id": "378", "question": "What is the type of the aircraft that, in July 2013, was involved in an incident at an airport where it had a malfunction in the APU battery system located in the rear compartment, leading to an airworthiness directive issued by the FAA in 2013 that applies to it? This airport had previously experienced an incident in 2008 involving a Boeing 777 aircraft that had a malfunction in the flap system resulting in no deployment, which led to a safety investigation.", "true_answer": "Boeing 787 Dreamliner"}
{"task_id": "379", "question": "A rider started from 11th position and achieved victory in a race at Sachsenring in July 2010, which marked the first occurrence of the Moto2 class there. What was his points total in the standings after 7 rounds in July 2010?", "true_answer": "111 points"}
{"task_id": "380", "question": "What is the value of the distance achieved by the athlete who set the South Dakota state record in shot put in 2012, participated in the boys shot put event at an athletics competition first held in France in 2011, and was the first recipient of the Gatorade award for boys track and field in South Dakota for the 2011-2012 season?", "true_answer": "20.35 meters"}
{"task_id": "381", "question": "What is the name of the author who wrote the work that examines the relationship between self and world in Josiah Royce's philosophy, which is part of the same collection as the work authored by Thomas that discusses operationism?", "true_answer": "Bhagwan B. Singh"}
{"task_id": "382", "question": "What are the page numbers of the article authored by the author of \"X-Planes of Europe\" published by Crécy Publishing, which discusses the origins of a Royal Air Force force employed for nuclear sampling missions using aircraft equipped with airborne radioactive debris collection systems during the Cold War era, published in January-February 1999 in a publication themed \"Cold War strategic air power\" that features technical analysis of a system that is part of the Handley Page Victor aircraft?", "true_answer": "pp.28–41"}
{"task_id": "383", "question": "To whom did the person who held the position that implemented the 2019 federal execution protocol using pentobarbital in the United States, issued a memo in November 2018 restricting the use of consent decrees to reform police departments, and whose department issued memoranda in 2018 restricting the use of civil enforcement to treat agency guidance as binding rules under the False Claims Act, send a public letter in February 2018?", "true_answer": "Senator Chuck Grassley"}
{"task_id": "384", "question": "\"During a football match on December 2, 1978, between two East German football clubs—one affiliated with a secret police force that conducted sting operations targeting East German football team's players after a midfielder defected to West Germany in 1979 and imprisoned three players for 11 months in 1981, and the other that won the championship in the 1984-85 season and played in a football league which had a 1969-70 season with 452 total goals, an average of 2.48 goals per game, and a top scorer with 12 goals—how many fans were arrested?\"", "true_answer": "35 to 38 fans"}
{"task_id": "385", "question": "A person founded a company that was the first to establish a mail-order business for automobile parts and operated before 1920. This person also established a university in California, which was required by the founder's will to relocate to a coastal campus by 1987. What was this person's age in July 1962?", "true_answer": "76"}
{"task_id": "386", "question": "In the Wimbledon Gentlemen's Doubles tournament held in 2005, which was the first time a player representing a particular country won the event, a winning pair consisting of two players secured the title. One player represents one country, and the other represents the country achieving its first win in this event. What are the names of these two countries represented by the winning players?", "true_answer": "Stephen Huss represents Australia and Wesley Moodie represents South Africa"}
{"task_id": "387", "question": "What is the name of the author of a book that critiques Kelsen's pure theory of law, analyzes the magical-religious origins of legal concepts, and rejects natural law and positivist voluntarism?", "true_answer": "Axel Hägerström"}
{"task_id": "388", "question": "For how many years has the person who runs a paper included in the book titled \"Right Ho, Jeeves\"—which involves a beach beauty pageant and Aubrey Upjohn—been running the paper, considering that this person owns a building that hosts the beach beauty pageant, is part of Brinkley Court, and appears in \"Right Ho, Jeeves\"; conspired with another person who used a fake illness to avoid a business deal obligation, appears in \"Stiff Upper Lip, Jeeves\", and required assistance from Jeeves; and also appears in a P.G. Wodehouse novel featuring Gussie Fink-Nottle's newt collecting hobby and involving a secret from the Junior Ganymede Club regarding Eulalie?", "true_answer": "Four years"}
{"task_id": "389", "question": "Where did the signing of Commonwealth Act 39, which is the charter of a city and is a document that establishes a municipal council framework, take place? Commonwealth Act 39 was amended by an act that establishes elective mayor and vice-mayor positions and by Republic Act 7160, which introduces elective mayors. Additionally, another act grants regulatory power to the special economic zone authority, permits fee collection by the special economic zone authority, and created a special economic zone in that city.", "true_answer": "At the Malacañang Palace"}
{"task_id": "390", "question": "What is the name of the Canadian general who served in World War II, is from a place that has a 20th-century landmark called Guildhall which is part of the Royal Observer Corps, equipped with a Blast Pressure Indicator, and located in the same place?", "true_answer": "Guy Simonds"}
{"task_id": "391", "question": "What is the page range of the article that critiques the term 'heavy metals', is part of the 2001 special issue on colloid and surface chemistry published by IUPAC, and is published in the journal that is the official journal of the organization which has the Committee on Molecular Machines and sponsored a public consultation to standardize molecular machine terminology, and which also publishes a book developed by the Committee on Molecular Machines, published by IUPAC, that defines nomenclature for molecular machine terminology and incorporates results from a public consultation on molecular machinery definitions?", "true_answer": "pp.793–807"}
{"task_id": "392", "question": "In which year did the Beninese politician, who served from 1960 to 1961 as the first President of a place located in Benin that had Elisabeth Ekoué Pognon as its first female member, pass away?", "true_answer": "2016"}
{"task_id": "393", "question": "What is the name of the company that was responsible for building the heavy water plant located in the place where the first successful transatlantic two-way wireless communication occurred?", "true_answer": "Deuterium of Canada Limited"}
{"task_id": "394", "question": "What was the original name of the street that starts near the street with Saint George's Palace, which is part of the Bank of Saint George, the oldest public bank, and where Gio Battista Grimaldi Palace, part of the Rolli Palaces, a UNESCO World Heritage Site, is located?", "true_answer": "Carrubeo recto"}
{"task_id": "395", "question": "In what month and year did a rumor claiming the death of the General Secretary of the Communist Party of China begin circulating, leading Asia Television (ATV) to falsely report his death—resulting in a HK$300,000 fine by the Hong Kong Broadcasting Authority—and prompting Chinese state media to label the news as \"pure rumor\"?", "true_answer": "In July 2011"}
{"task_id": "396", "question": "In which year did a refueling event occur involving a British military aircraft that carried the Yellow Aster radar and performed strategic reconnaissance missions during the Cold War, and an aircraft requiring high-altitude aerial refueling support that commonly conducted refueling operations with the British aircraft, which later participated in a military exercise event in June 1990 involving an emergency landing of the British aircraft due to engine overheating damaging flight controls?", "true_answer": "1978"}
{"task_id": "397", "question": "What was the score of the final home game of the brothers who were born in a city located in Siberia, Russia, that hosts the largest oil refinery in Siberia, whose combined points exceed 2000, and who have their numbers retired by a team that retired its original mascot named Prankster Bear and has an arena originally named General Motors Place?", "true_answer": "4–3, with the Canucks defeating the Coyotes"}
{"task_id": "398", "question": "How long did it take the author, who served as the Harlem bureau chief for The Chicago Defender and co-authored a newspaper-formatted book covering the United States from 1493 to 1941 co-edited by Sylvan Hoffman and C. Hartley Grattan, to find a publisher for his biography of the first woman to lead a Union military operation during the U.S. Civil War—a Union military operation that involved the 2nd South Carolina Volunteer Infantry Colored, destroyed Confederate rice plantations, liberated over 700 slaves, and was commanded by Colonel James Montgomery?", "true_answer": "Four years"}
{"task_id": "399", "question": "Who finished third in the stage of the 2010 Tour de France that concludes with the climb which is the highest point of stage number 15 of the 2007 Tour de France?", "true_answer": "Aitor Pérez"}
{"task_id": "400", "question": "What is the number of pages in the edition of the final collected volume of the graphic novel series that features Jepperd mentoring Gus, concludes with Gus leading hybrids to Alaska's sanctuary following a global human extinction, and whose edition concludes with Gus's journey resolving the post-apocalyptic conflict?", "true_answer": "152 pages"}
{"task_id": "401", "question": "What is the name of the typical lapel opening style of a type of nomadic clothing that originated from a nomadic group in Northeast Asia, features zoomorphic plaques hung via chains, and has an archaeological example—a gold nomadic adornment used by this nomadic group, discovered in an Inner Mongolia archaeological site, with design elements of a central human figure interacting with quadrupedal beasts, animal features of long manes arranged into three lines, and archaeological significance due to early human-animal hybrid composition—while this nomadic group also produced bone plaques depicting a hunter shooting a deer?", "true_answer": "The lapel opening was typically zuoren"}
{"task_id": "402", "question": "In which year was the Kenyan runner born who won the Olympic 3000m steeplechase, the first Olympic event where all medalists were from the same nation, Kenya?", "true_answer": "1972"}
{"task_id": "403", "question": "An Australian boxer, who was the first world champion to retire undefeated, held a title that was first recognized by the International Boxing Union (IBU) and transitioned under the New York State Athletic Commission after the IBU's dissolution in 1963. When did this boxer die?", "true_answer": "1990"}
{"task_id": "404", "question": "What is the title of the article that discusses the historiography of conquest in Latin America, authored by someone who also wrote a book that studies interethnic litigation cases using notarial records, focuses on colonial Huamanga, discusses indigenous responses to Spanish colonization in Huamanga, and who also edited a book that analyzes colonial tribunal archives and studies peasant consciousness in the Andean region?", "true_answer": "Paradigms of Conquest: History, Historiography, and Politics"}
{"task_id": "405", "question": "What is the name of the organization, which is an organization, that honored an individual for the individual’s work as a seasonal firefighter in the 1970s, where that same individual co-founded a company (which is a company) that partnered with Blockchain Laboratories and developed a carbon credit registry on the XRP Ledger (XRPL) for issuing Future Mitigated Units (FMUs) from government-backed reforestation projects?", "true_answer": "The Glens Falls Firefighters Association"}
{"task_id": "406", "question": "What is the name of the goaltender who plays for the Florida Panthers—a team whose fan tradition is throwing rubber rats after home victories—and who was the goaltender during an event that occurred on February 14, 2004, at an arena where a player for the Anaheim Ducks—a team with the \"Quack Attack\" fan tradition—achieved his 1000th career point? This event involved the first player from an NHL team known for the \"Towel Power\" fan tradition to reach 1000 career points, who received an assist from an NHL player who is the first of a twin pair—both twins have career points exceeding 1000—to surpass that milestone.", "true_answer": "Roberto Luongo"}
{"task_id": "407", "question": "What is the name of the play, written by a physician who transitioned to playwriting and who also authored an essay on the role of humanities in medical education published in Internationale Klinische Rundschau, which was produced by a theatre in Florida that launched an initiative offering the VIP Performing Arts Program focusing on inclusion, diversity, equity, and access?", "true_answer": "La Ronde"}
{"task_id": "408", "question": "What is the name of the production that was staged as an all-night performance by a company that stages productions in the Asolo Theatre, which was constructed by Antonio Locatelli and is located in Caterina Cornaro's castle audience hall?", "true_answer": "The All Night Strut"}
{"task_id": "409", "question": "An environmental group that organized both a symbolic Citizens' Assembly at the Scottish Parliament on Burns Day 2019 and a protest involving bicycles blocking access points and a symbolic 'lie-in' with a bulldozer mock-up opposing airport expansion plans had an offshoot group that planned to disrupt airport operations using drones in restricted aviation zones. In September 2019, at the location where the previous protest had occurred, this offshoot group carried out an action. How many people were arrested during this action?", "true_answer": "Nineteen people were arrested"}
{"task_id": "410", "question": "What is the official website of the event first held in the year that hosted the Head of Shang Mun Regatta—an annual rowing event featuring long-boat competitions on Shing Mun River—which occurred in 1985 and was organized by a Bangkok-based organization founded in 1982 that also organizes the regatta where Japan and South Korea are top competitors?", "true_answer": "The official website is the ARF site"}
{"task_id": "411", "question": "Which year did the American baseball player and coach, who managed a team in 1978 that changed its name to Trenton Statesmen that same year and played home games at Mercer County Park in 1977, and who participated in a slow-pitch league that saw a team join the Philadelphia Athletics in 1978 after disbanding the New York Clippers, pass away?", "true_answer": "2001"}
{"task_id": "412", "question": "What is the name of the legislative body where the first Filipino-American member of the California State Legislature served from 1992 to 1998, after being elected as a Republican in 1992, later switching to and chairing another party, and sponsoring a healthcare bill on surprise medical billing?", "true_answer": "California State Assembly"}
{"task_id": "413", "question": "What is the nationality of the player who achieved three home runs in a single game during 1998—the first to do so since 1987—and who played for the team that faced three home runs by Sammy Sosa in a game on June 15, 1998?", "true_answer": "Puerto Rican"}
{"task_id": "414", "question": "In 1972, a flight that departed from a location in the United Kingdom—where the first direct mainline train link to a dedicated airport station was established—and involved an aircraft type (recognized as an aircraft type) that had a total production number of 117 and delivered 35 units to the Chinese airline CAAC, experienced a ground resonance accident. How many people were on board that flight?", "true_answer": "118 passengers and crew"}
{"task_id": "415", "question": "In which year did the Canadian astronomer, who was the first Canadian woman to earn a PhD in astrophysics and served in a position established in 1918, originally titled \"Advisor of Women\" and first held by Caroline Emmy Libby McNeill, pass away? The holder of this position later became a lecturer in Spanish and Italian.", "true_answer": "1988"}
{"task_id": "416", "question": "Which artist, who covered on their 2004 album a song originating from the soundtrack of the musical \"Hedwig and the Angry Inch\" (which had its first vinyl release in 2021), and whose song was also covered by another artist to fundraise for LGBTQ+ youth via the Hetrick-Martin Institute, and whose original version was covered by Miriam Clancy as part of a tribute to Derrick Rump, co-owner of Club Q, has a name that answers this question?", "true_answer": "Ben Jelen"}
{"task_id": "417", "question": "An individual co-authored a foundational text in algebraic number theory, which was first published by Blaisdell Publishing and later reprinted by Dover Publications. This individual also co-authored with another person who co-authored with Paul T. Bateman and has a work titled \"Analytic Number Theory: An Introductory Course\" published by Springer. What is the profession of this individual?", "true_answer": "Mathematician"}
{"task_id": "418", "question": "What year did the investigator, whose alternative nickname was associated with the head of the Metropolitan Police Flying Squad also known as The Grey Fox, die, after leading a case where the stolen train's diesel locomotive couldn't be restarted by the perpetrators, requiring the original driver to operate it?", "true_answer": "1970"}
{"task_id": "419", "question": "\"What is the name of the song that peaked at No.4 in Australia and No.3 in New Zealand in 1992, from the second studio album released in 1992 by a musician who won three consecutive ARIA Best Male Artist awards from 1993 to 1995, which album peaked at No.1 in Australia and won an award also won by the musician, and has a subsequent album that peaked at No.1 in Australia, contains live performances of this song and an acoustic version of 'I've Been Loving You Too Long'?\"", "true_answer": "Tip Of My Tongue"}
{"task_id": "420", "question": "What is the name of the football club that started their 1999 campaign with a 5-1 victory against Guará and went on to win the 1999 Copa do Brasil final—the last edition held at a stadium that hosted the 1990 concert by Paul McCartney with 184,500 attendees? This team defeated an opponent who had advanced via the away goals rule after a 2-2 draw in the second leg against a football club that had won the 1999 Campeonato Paulista final against Palmeiras at Morumbi Stadium. The opponent had participated in the 1999 competition semifinals, which featured teams EC Juventude and Bahia, was determined by a penalty shootout, and led to a final hosted at Ecinaldo Guedes Stadium.", "true_answer": "Esporte Clube Juventude"}
{"task_id": "421", "question": "What is the number of the miners, who are identified as miners, that were injured in an incident classified as an accident, which took place in July 1967 and involved a steep spiral staircase descent, and that was also suffered by a project classified as a gold mine project, which is located in a certain place and involves tunnel expansion?", "true_answer": "49"}
{"task_id": "422", "question": "During 1954, what was the name of the senior staff role involved in naval strategic planning, held by the first Hispanic flag officer who studied nuclear weaponry at the institution that first introduced nuclear deterrence studies as core curriculum in the early 1950s?", "true_answer": "Assistant Chief of Staff for Naval Operations"}
{"task_id": "423", "question": "\"What alias did the 19th-century Australian outlaw who led the largest gold heist in Australian history use when he met the person who participated in the 19th-century Australian gold heist that inspired a Sherlock Holmes story and led to the presentation of an ornate coffee urn to Amelia Campbell, as well as the Dunn's Plains attack on Gold Commissioner Keightley's home in 1862?\"", "true_answer": "Jones"}
{"task_id": "424", "question": "What are the page numbers of the article whose title is the first to focus on a 19th-century British female journalist and sociologist, and which is part of a work that has an official app containing over 5,500 questions and 100 levels?", "true_answer": "63–80"}
{"task_id": "425", "question": "What is the title of the third story in a volume of the first work to use allegorical tales to explain political economy principles, authored by someone who wrote the first series of such tales in 1832 and was later cited by an author of a collection of allegorical tales explaining political economy principles published after 1832?", "true_answer": "A tale of the Tyne"}
{"task_id": "426", "question": "Which publisher, having released a book containing a chapter about early sociological methodology and a country whose capital is Riga, where that chapter also discusses an agricultural system originating in that country featuring Baroque French garden design and including “aprivor Peach Orchards in Cold Climates,” analyzes 18th-century estate management practices, integrates sociological analysis of subsistence farming, and discusses a systematic methodological treatise written by a 19th-century British female author who pioneered sociological analysis, has the name ?", "true_answer": "University College Dublin Press"}
{"task_id": "427", "question": "What is the size of the ovarian cyst found during the autopsy of the British author who translated into English and added explanatory notes to a certain work?", "true_answer": "Twelve inches in diameter"}
{"task_id": "428", "question": "An essay titled \"Letters to the Deaf,\" published in 1834, addresses societal challenges of deafness and recommends something that is discussed in an article that is part of a children's biography series. This series includes an illustrated biography about historical figures and has an associated application containing over 5,500 questions and 100 levels. The article was published in a journal that has volume number \"?\". What is the volume number of that journal?", "true_answer": "3"}
{"task_id": "429", "question": "What is the name of the university press that published a collection edited by Dr. Michael Barber, which is housed at Cambridge University Library, containing a book that includes descriptions of the impact of the Irish Potato Famine and writings by a person whose letters from them are also included in the collection, and which also contains letters to a person who is a cousin of Charles Darwin?", "true_answer": "Stanford University Press"}
{"task_id": "430", "question": "What is the name of the publisher that released a book discussing a fictional narrative written by Harriet Martineau that explores the consequences of industrial machinery on labor wages?", "true_answer": "Leicester University Press"}
{"task_id": "431", "question": "What is the title of the second story in volume 8 of a collection of political economy tales written by a 19th-century feminist economist, which also contains a story set in a fictional Pennsylvania prairie that critiques religion divorced from material conditions and explores family inheritance and economic philosophy?", "true_answer": "The three ages"}
{"task_id": "432", "question": "What is the title of the first story in the volume that contains a story critiquing the 1834 Poor Law Amendment Act through analysis of workhouses and poverty and is part of a work that also contains another story criticizing colonial economic systems and analyzing plantation slavery contradictions?", "true_answer": "Mrssrs. Vanderput and Snoek"}
{"task_id": "433", "question": "What year was the first edition of a guidebook published, which initially included an account that is the subject of macrofossil analysis in six conservation-protected English lakes (SSSI/SAC), provided baseline data for reference conditions to assess ecological degradation, and was studied in palaeoecological records spanning 150-200 years?", "true_answer": "1855"}
{"task_id": "434", "question": "At a cemetery featuring a Grade I listed Anglican Chapel that contains a hydraulic catafalque, there is a monument. One face of the monument lists the name of a Chartist leader who delivered a speech at the inauguration of a statue in the same cemetery. Another face lists the name of a person who translated the work of someone whose tenets led to the founding of a religious organization in Brazil. What is the name of this face?", "true_answer": "The east face"}
{"task_id": "435", "question": "What is the title of the tale that is the first tale in a series that is part of a political economy series which was serialized in a women's magazine, targeted 19th-century readership, used fictional narratives, explored the societal impacts of taxation, and explained market mechanisms; whose author translated a work by a philosopher who founded positivism philosophy, instituted the religion of humanity after his partner's death, coined the term \"altruism\", redefined positivism into a moral religion, and emphasized that love guides societal order; and this translated work was initially presented as a 72-lecture series starting in 1826, evolved into a 6-volume series, established the basis for positivism, and is the predecessor to the \"System of Positive Polity\"?", "true_answer": "The park and the paddock"}
{"task_id": "436", "question": "What is the name of the publisher who was the original publisher of the novel published in 1837, written anonymously by a British journalist, which criticizes social stratification in a historical period that implemented the abolition of primogeniture laws, led to divided land inheritance among all children, affected social stratification through land distribution, and is analyzed in sociological studies on social stratification in that historical period?", "true_answer": "Saunders and Otley"}
{"task_id": "437", "question": "What is the title of the second tale in a series of tales that depicts workers poaching game as a protest against taxation, critiques class divisions via property tax inequities, is part of early sociological discourse, and is authored by an individual who contributed to the development of early sociological thought and translated a two-volume condensed version of \"Cours de philosophie positive,\" introducing positivism to English-speaking audiences?", "true_answer": "The tenth haycock"}
{"task_id": "438", "question": "What is the publication year of the book analyzing Harriet Martineau's contributions to 19th-century feminist thought and classical economics, authored by the same writer who also wrote about Victorian London's Thames Embankment project and its interplay between environment, technology, and society, when both books were published by the publisher that also published a book analyzing the interplay between 19th-century feminist economic theories and environmental impacts of Victorian infrastructure projects like the Thames Embankment, which is part of the Human-Environment Interactions series?", "true_answer": "1980"}
{"task_id": "439", "question": "There is a book that discusses another book, which is also a book analyzing a text that employs telegraphy, reports on the Indian Mutiny of 1857, and is published in The Times, and there is a third book that analyzes a different text and has the second book as its subject, where that text incorporates statistical data from Florence Nightingale Crimean War mortality studies, is published in the Daily News, and critiques military healthcare practices during the Crimean War. What is the title of the first book?", "true_answer": "Contested Liberalisms: Martineau, Dickens and the Victorian Press"}
{"task_id": "440", "question": "What is the name of the person who edited a work that documents the political and moral causes of the Civil War from transatlantic perspectives, which includes a section that employs demographic and economic analysis, examines transatlantic economic dependencies between U.S. slavery and British industries, and critiques systemic contradictions in democratic economies reliant on slavery?", "true_answer": "Deborah Anna Logan"}
{"task_id": "441", "question": "What is the name of the publisher that published in 1838 a work written by a British author, which analyzes a subject that led to over 300 freedom suits in St. Louis from 1812 to 1865, resulting in less than half of the plaintiffs gaining freedom?", "true_answer": "Saunders and Otley"}
{"task_id": "442", "question": "Who is the author of a work that discusses that a collection of stories, which includes a story included in \"Illustrations of Political Economy\" and lacks a Wikipedia article, is a precursor to the industrial novel genre, and this collection discusses the impact of labor strikes on domestic economies and is itself a precursor to the industrial novel genre?", "true_answer": "Ivanka Kovačević"}
{"task_id": "443", "question": "What is the title of the book authored by an individual who holds an MBA in finance and marketing from a university in Africa that established the first African Studies department and hosts the journal Social Dynamics, who uses a pseudonym, and co-authored a crime novel series dealing with financial crimes with their daughter? This book is about a person who authored a travelogue analyzing Middle Eastern societies using systematic sociological methodology, laid the foundation for Islamic sociology of religion, advocated for feminist principles through sociological analysis, and translated a six-volume philosophical work by Auguste Comte into one English edition published in 1853 that influenced the development of positivism.", "true_answer": "Harriet Martineau: The Woman and Her Work, 1802–76"}
{"task_id": "444", "question": "What is the title of the book authored by a person who analyzed the convergence of feminist and abolitionist agendas, applied linguistic structural analysis, co-authored with another individual, and focused on 19th-century ideological texts; the book is about a work that translated a text which introduced positivism to English readers and influenced 19th-century ideological texts; this translated text's first lecture outlines three stages—theological, metaphysical, positive—and was analyzed by Franz Brentano, who criticized the exclusion of metaphysics as a science; this text was published as six volumes between 1830 and 1842 by Bachelier?", "true_answer": "The Woman and the Hour: Harriet Martineau and Victorian Ideologies"}
{"task_id": "445", "question": "What is the name of the contributor who contributed to pages 583-586 of a work that has pages 583-586, focuses on non-Pueblo Southwestern cultures, and includes a section on a type of pottery symbolism that employs patterned markings to symbolize color in black-and-white arts and applies to Mimbres bowls?", "true_answer": "The contributors are not specified in the given text"}
{"task_id": "446", "question": "What is the title of the story that is the first story in Volume IV of a collection of fictional narratives translating political economy theories? This collection, authored by a woman who was the first female member of a statistical society established before 1887 that had Florence Nightingale as a member and contributed to statistical analysis in healthcare, also contains a story that critiques the entailment system and explores the economic consequences of inheritance laws. The author translated a work by a French philosopher that posits a hierarchical structure of sciences—from physics to chemistry to biology to sociology—and she authored the first book to use statistical census data combined with political economy principles, which critiques American societal structures.", "true_answer": "Homes abroad"}
{"task_id": "447", "question": "What is the name of the modern publisher that reissued in 2009 a book authored by the author of \"George III and the Hanoverians,\" which was published posthumously, critiques the myth of egalitarianism in 19th-century America, compares British social hierarchies, and whose author had a posthumous edition of his work published in 1961 directed by his spouse?", "true_answer": "Cambridge University Press"}
{"task_id": "448", "question": "What is the name of the author who wrote the non-scientific social analysis guidebook that was replaced by the guidebook written by A introducing systematic empirical observation methodology?", "true_answer": "William Wordsworth's"}
{"task_id": "449", "question": "What is the title of the guidebook about a certain place, written by the author who developed a methodology enabling comparative analysis of regional cultural norms; who applied this methodology to critique their own work focusing on travel writings that analyze the portrayal of a dependency on an economic system dependent on slavery in the United States; and whose work title includes \"America\"?", "true_answer": "A Complete Guide to the English Lakes"}
{"task_id": "450", "question": "A 19th-century French sociological theory framework, structured in multiple volumes, introduced the foundational concept of social physiology and employed a positivist methodology. An individual translated and condensed this work, preserving its quantitative analysis methodology and adding editorial analyses on positivist philosophy principles. This translation resulted in a work that enabled the systematic study of urban poverty patterns in Victorian England. The same individual authored a series about political economy, where Volume III contains a third story that critiques landlord-tenant economic exploitation. What is the title of this third story?", "true_answer": "Ireland"}
{"task_id": "451", "question": "In which year was the book published that was written by an author affiliated with the University of the Witwatersrand, examines moral philosophy in the novels by Harriet Martineau, analyzes her novels using 19th-century socioreligious perspectives without modern feminist theory, integrates gender studies and transatlantic cultural analysis, and was published by Routledge as part of a series?", "true_answer": "1995"}
{"task_id": "452", "question": "In which year did a report state that an institution located in London, which holds \"Self-Portrait with a Pink\" (a self-portrait painted by its artist) and collaborated with another London institution that collaborated with the Museum of the Home and acquired \"A Young Teacher\" (1861), held several portraits of a 19th-century British woman who introduced positivism to the UK by translating a six-volume French work written by a person who coined the term \"altruism\" and linked altruism to maternal love and the frontal brain regions in \"Système de Politique Positive\", and which introduced the term \"sociology\", was written in French, translated into English, and laid the foundation for positivism in the UK?", "true_answer": "2014"}
{"task_id": "453", "question": "What is the title of the work, published in 1836, that was published by a 19th-century British author who translated a work written by Auguste Comte which introduced the term \"sociology\"?", "true_answer": "Miscellanies"}
{"task_id": "454", "question": "What is the name of the publishing house that published the first academic analysis which employs empirical social observation methodology, examines through essays, focuses on the integration of literary form and moral advocacy, and analyzes a moral philosophy that examines tenant-landlord relations in Ireland, employs class-based critique, and advocates economic reforms for societal well-being?", "true_answer": "Scolar Press"}
{"task_id": "455", "question": "An author who had a condition affecting her spine and experienced loss of taste and smell believed she had a medical condition related to loss of taste and smell. She was treated with a medical treatment that was used to treat railway spine and later evolved into hypnotism. What is the name of the medical condition she believed she had?", "true_answer": "Hysteria"}
{"task_id": "456", "question": "On the digital version of Vogue magazine launched in 1995, which has a wine pairing tool that uses AI and data science for personalized recommendations, there is a feature page highlighting an individual who authored a book published by HP Books in 1980 and received an award in 1980 that was awarded to a cookbook focusing on French cuisine. What is the name of this individual?", "true_answer": "Anne Willan"}
{"task_id": "457", "question": "A singer who has a career in Christian contemporary music began their public career at the funeral of their brother, who died in a car accident in 2017. At the funeral, they gave their first public performance of \"What a Beautiful Name\". They won an award at an event in a category that merged with Best Pop Instrumental Performance in 2012. In which year was the event held?", "true_answer": "2023"}
{"task_id": "458", "question": "A visual artist based in Chicago, who started employment in 1979 at a Chicago-based organization that offers the ArtTechProgram established in 1969, received a merit-based visual artist grant founded by Chris Vroom in 1999, operating in multiple US cities, in 2001 and 2008. In which year was the artist born?", "true_answer": "2002"}
{"task_id": "459", "question": "Which scholarship, which is a scholarship, was received by the first Caucasian female martial artist—who was accepted after studying ballet at the University of Michigan and was the first to star in the only film for Jhoon Rhee (suggested by Bruce Lee, produced by Raymond Chow, co-starring Angela Mao, and related to Hapkido (film))—and has the name ?", "true_answer": "A scholarship at the Banff School of Fine Arts"}
{"task_id": "460", "question": "A talent scout was managed by a manager. The talent scout and the manager offered a contract to an actress. The actress was the lead actress in a play that uses abstract movement and features a symbolic journey into the mind's shadowy depths. This play was produced by a regional theater company that prioritizes innovative theatrical narratives. The play won an award given to it. How long had the talent scout and the manager worked together before offering a contract to the actress?", "true_answer": "Several months"}
{"task_id": "461", "question": "What is the name of the artwork, created in 1999, by an artist whose project integrates restoration science and philosophy, who collaborated with a museum that collaborated with MVRDV, has rotating glass facade panels for UV protection, and integrates restoration science and environmental philosophy?", "true_answer": "Harries hoofdingang"}
{"task_id": "462", "question": "What is the title of the work, which is mentioned in a text, authored by the person who co-founded, together with the author of \"Wichita Vortex Sutra,\" the school that collaborated with Jane Dalrymple-Hollo, produced a limited-edition chapbook, and conducted activities as part of the [Dis]embodied Poetics Conference?", "true_answer": "Fast Speaking Woman"}
{"task_id": "463", "question": "What is the title of the book written in 1948 by an author who designed the cover for and wrote a poetry collection published in 1967, which is included in the National Library of Ireland Collections categorized as 20th-century Irish poetry?", "true_answer": "Cavaliero (The Life of a Hawk)"}
{"task_id": "464", "question": "What is the title of the text that mentions two ballet dancers, both possessing the gift to fly in cadence, one of whom has a mid-air flight pose, both of whom are depicted in an engraving created by an 18th-century French engraver employing linear perspective for motion, which is housed in a location and is related to the text?", "true_answer": "Anne and Janneton Auretti"}
{"task_id": "465", "question": "In what year was the painting created that depicts clerks confronting a sudden alarm, employs expressionist techniques, and is among the earliest narrative works of an artist who was chief stage designer at a theatre whose productions in the 1930s had lower standards than the Gate Theatre, contributed stained glass and portraits to the theatre's foyer, co-founded a print studio whose first major project was a collaborative artist exhibition, and produced a series based on James Joyce's Ulysses?", "true_answer": "1937"}
{"task_id": "466", "question": "In which year was a photograph taken that depicts a person born in 1926 who was 36 years old at the time, who held the position of Minister of Electronic Industries in China, later served as Mayor of Shanghai, then rose to a leadership role in Shanghai's political hierarchy during the mid-1980s, managed the 1986 Shanghai student demonstrations, and implemented reforms that were part of Shanghai's early 1980s economic restructuring drive initiated following government approval in 1985, which positioned Shanghai as an international financial hub?", "true_answer": "1962"}
{"task_id": "467", "question": "What is the title of the book that is written by the author of a book that analyzes the decision-making processes of China's leaders and contains in-depth interviews with Chinese government officials, and is about a Chinese political leader who narrowly avoided expulsion from the Chinese Communist Party in 1982, has a background in electrical engineering, and led an initiative that included the Three Replacements Initiative, modernized state-owned enterprises in China, and required replacing administrative controls with market mechanisms in leadership appointments, product sales, and capital raising?", "true_answer": "The Man Who Changed China: The Life and Legacy of Jiang Zemin"}
{"task_id": "468", "question": "What is the name of the event during which the Chinese political theory that reformed the membership criteria of the Communist Party of China by including previously excluded social classes that are part of the new social strata was written into the governing document of the Communist Party of China?", "true_answer": "The 16th CCP Congress in 2002"}
{"task_id": "469", "question": "What is the name of the author who wrote a book that analyzes an event during which the yuan non-devaluation policy was implemented, providing rare behind-the-scenes analysis via interviews with cadres and civil servants?", "true_answer": "Willy Wo-Lap Lam"}
{"task_id": "470", "question": "On 29 May 2017, an appearance of the entity that authored a measure introduced by the CPC Central Committee—aimed to combat corruption and bureaucratic excess and reaffirmed as “long-term and effective rules of iron”—took place. A CCP National Congress report issued in 2017 excluded reaffirmation of that measure. Where did that appearance occur?", "true_answer": "At Shanghai Technology University"}
{"task_id": "471", "question": "What is the name of the person who had almost unanimous support to become the new CCP general secretary before the Plenum that followed the 5th Plenum of the 15th Central Committee, which finalized the 10th Five-Year Plan of China?", "true_answer": "Hu Jintao"}
{"task_id": "472", "question": "Who is the individual who was the direct beneficiary of an event that followed major protests in 1989 in a certain location, which resulted in enhanced authority of an entity responsible for public security and judicial coordination, and which is also the direct beneficiary of Xi Jinping's Initiative for Legal System Oversight and Stability, where the 1989 Economic Sanctions by the U.S. House were in response to protests in this location?", "true_answer": "Jiang Zemin"}
{"task_id": "473", "question": "What is the ideological theory of the Chinese Communist Party, proposed by a leader who implemented policies enabling private entrepreneurs to join the CCP and administered crackdowns resulting in a tax evasion case in 2002 involving a relative of a celebrity as company manager, where the celebrity was detained for 422 days without prosecution, and interpreted by an individual who was dismissed in 2003 from an entity after investigating an incident that involved suppression of disease outbreak information leading to his dismissal, with the entity having paid for advertorial inserts named 'China Watch' in outlets like The New York Times and Washington Post?", "true_answer": "It is just common sense and not a proper theoretical framework"}
{"task_id": "474", "question": "Were foreigners invited to attend the memorial service for an individual, which is a type of memorial service that allows foreign diplomats but excludes foreign heads of state, and is part of state funeral proceedings held at a memorial venue in Beijing that hosts such proceedings, permits attendance by foreign diplomats but excludes foreign heads of state, is associated with scattering ashes into the Bohai Sea as part of its ceremonies, and is a government complex in Beijing?", "true_answer": "No"}
{"task_id": "475", "question": "What is the title of the book that provides a journalistic account detailing Jiang Zemin's Shanghai faction's political maneuvering during his tenure as Shanghai party secretary (1985-1989) that enabled his emergence as China's paramount leader?", "true_answer": "Tiger on the Brink: Jiang Zemin and China's New Elite"}
{"task_id": "476", "question": "What is the name of the incident that occurred on April 1, 2001, which strained the bilateral relationship between China and the United States, and occurred during an event in 2001 involving China and Russia that led to the founding of an organization established in 2001, originating from the Shanghai Five and including the admission of Uzbekistan? Additionally, the bilateral relationship between China and the United States was impacted by an agreement between them, signed in 2001, pertaining to World Trade Organization accession terms and resolving disputes over agricultural subsidies and services market access.", "true_answer": "A United States EP-3 surveillance aircraft collided mid-air with a Chinese Shenyang J-8 jet fighter over the South China Sea"}
{"task_id": "477", "question": "After serving as a member of an expert team sent to a project initiated by the First Ministry of Machine-Building Industry of China—which involved establishing 15 machinery manufacturing plants in Romania between 1970 and 1972—and later simultaneously holding the positions of General Secretary of the Communist Party of China, President of China, and Chairman of the Central Military Commission, an individual handed over most of the economic governance in 1997 to another person. What is the name of this person?", "true_answer": "Zhu Rongji"}
{"task_id": "478", "question": "What is the name of the person who succeeded an individual who held the position of Communist Party Chief of Shanghai, established in 1990 an entity approved by the State Council of China focusing on a dual-core strategy of advanced manufacturing and producer services, and who later served as the paramount leader of China before 2002? This successor held a position that convenes meetings of the highest governing body, to which an office led by the Director of the General Office of the CPC Central Office is subordinate and which implements the decisions of this governing body.", "true_answer": "Hu Jintao"}
{"task_id": "479", "question": "What is the name of the place where a person, who made a state visit to the United States and gave a speech, and who approved in 1992 a project that has six proposals (including five return vehicles and one space station module), which is part of a larger program that includes Proposal 1030—a three-stage reusable spaceplane submitted by the China Academy of Aerospace Aerodynamics and has a total of six initial proposals approved in 1992—gave the speech?", "true_answer": "Harvard University"}
{"task_id": "480", "question": "How many sons does the Chinese leader who proposed the Three Represents ideology—a core component of the Communist Party of China's governing philosophy—and who held the position of General Secretary of the Communist Party of China, have with his spouse who accompanied him and attended an event in 1999 hosted by Jacques Chirac at Château de Bity in France?", "true_answer": "Two"}
{"task_id": "481", "question": "What is the name of the person who succeeded Hu Jintao as CCP general secretary by the time of a state banquet that occurred in October 2014 and featured performances of piano and tenor solos with Chinese cultural elements by students?", "true_answer": "Xi Jinping"}
{"task_id": "482", "question": "\"Which extralegal department, established in June 1999 by a leader who approved a search and rescue team established in 2001 that participated in the 2003 Algeria earthquake response mission and was the first Chinese team to pass the INSARAG International Evaluation of Capacity in 2009, is responsible for cracking down on a spiritual movement that originated in China and became the target of an international coalition formed in 2006?\"", "true_answer": "610 Office"}
{"task_id": "483", "question": "What is the name of the secretary, from the place where the project aimed at developing armored vehicles disguised as mobile water tanks was developed, who was the secretary of the person who served as First Lord of the Admiralty during World War I and illegally allocated £70000 from Admiralty funds to establish an organization that first adopted the codename \"tank\", was tasked with developing armored vehicles, and transitioned control from the Royal Navy to the British Army?", "true_answer": "Elizabeth Nel"}
{"task_id": "484", "question": "What is the name of the Canadian journalist and author from a town that sent representatives to the Model Parliament of 1295 that established the basis for modern parliamentary representation?", "true_answer": "Richard Gwyn"}
{"task_id": "485", "question": "Who is the digital writer and artist known for multimedia projects, who is from a place that was the location of a series of witch trials between 1599 and 1694, including one led by Matthew Hopkins that executed 18 people in a single day, and which includes a historic site that was the location of a theatre designed by Robert Adam in 1774 and now hosts contemporary art exhibitions?", "true_answer": "Chris Joseph"}
{"task_id": "486", "question": "What is the name of the company that operates a railway station located in Suffolk, which was designed by an architect who also designed the Manchester South Junction and Altrincham Railway Viaduct featuring cast iron ribs, and which features a pair of towers at its eastern end and underwent an alteration involving the replacement of decorative chimneys with conventional pots?", "true_answer": "Greater Anglia"}
{"task_id": "487", "question": "A person who lived in the San Francisco Bay Area escaped six times from a facility originally named the Insane Asylum of Arizona, which contains the burial site of Catherine Clark. In their final escape, they used an object provided by a friend of a staff member to access the door of the facility. Convicted in 1931, of what crime was this person found guilty?", "true_answer": "The murder of two women"}
{"task_id": "488", "question": "What is the name of the location in England where a scheduled monument, which is a multivallate hillfort featuring Romano-Celtic temple remains, is located?", "true_answer": "About south-east of Weston-under-Redcastle, in Shropshire, England"}
{"task_id": "489", "question": "What is the title of the book that was written by the surgeon who pioneered hip replacement techniques using ultra-high molecular weight polyethylene and established the global standard for hip implants, which became the standard text for a field that includes a historical fracture treatment method standard for femoral fractures named after Harvey Gaylord Bryant?", "true_answer": "The Closed Treatment of Common Fractures"}
{"task_id": "490", "question": "When did a team get promoted from a basketball league division that was part of the Manchester Area Basketball League and was reintroduced after disbandment due to a league restructuring, and then, after multiple promotions, reached the top division of the English Basketball League, which requires the head coach to have a certain qualification?", "true_answer": "2015"}
{"task_id": "491", "question": "What is the name of the honor that was bestowed in 2009 by a borough that received an audit rating of four stars upon a film director who directed a movie referenced in the title of an accounting scandal that involved Price Waterhouse India and occurred in 2009?", "true_answer": "The Freedom of the Borough"}
{"task_id": "492", "question": "A rugby league team was formed from an event held at Castle Leisure Centre in December 2007 that united groups from southern Bury and northern Bury. In which year was this team formed?", "true_answer": "2008"}
{"task_id": "493", "question": "What is the name of the football club that was previously played for by a player who has international youth caps for a national team that won the 2014 UEFA European Under-17 Championship by defeating the Netherlands via penalty shootout after a 1-1 draw; this player also previously played for Bristol Rovers, retired from playing in 2021, was awarded the South West Regional Coach of the Year in 2022, and coached a team?", "true_answer": "Charlton Athletic F.C"}
{"task_id": "494", "question": "In what year did the children's writer, author of a children's novel featuring a protagonist with a clockmaker father and set in a mansion filled with 100 clocks—which has architectural features including a rotunda used for art display and one modeled after the Bildeston Clock Tower, with gardens designed by Capability Brown—move to a place associated with that mansion and located in the same place as the Bildeston Clock Tower?", "true_answer": "2001"}
{"task_id": "495", "question": "Which entity is the place that displays a steam roller, which is a steam roller built by Thomas Green & Son, has model Ω, is the sole surviving example of the Ω series, and nearly met her end in destruction, a part of?", "true_answer": "The East Lancashire Railway"}
{"task_id": "496", "question": "In which year was the person born who developed the total hip replacement prosthesis, where a metal femoral head articulates with a bearing surface that is known for minimizing wear and characterized by a low friction coefficient?", "true_answer": "John Charnley was born in 1911, and his father was a pharmacist in Bury"}
{"task_id": "497", "question": "An individual held positions at St John's College, Cambridge, first ending in 1815 and then from 1815 to 1839, totaling 37 years of tenure. This person authored \"The Elements of Algebra (1795)\" and bequeathed a library of nearly 4,500 books in classics, history, mathematics, theology, and travel (17th–19th centuries). Starting from 1820, they held a position with the role of Chief Justice, administering an area, but the name of this position is unknown. What is the name of this position?", "true_answer": "Dean of Ely"}
{"task_id": "498", "question": "What is the name of the notable cyclist who won the first road bicycle race held in England with three cyclists participating, and who is from the birthplace of the person born in Otley, Suffolk who led the first English colonial settlement in New England?", "true_answer": "James Moore"}
{"task_id": "499", "question": "Identify the former government minister and member of parliament who has chosen to retire to or have a second home in a place that hosted an event in 1645 resulting in the executions of 18 individuals. This place is also where another former government minister and member of parliament, who is married to the eldest daughter of Winston Churchill, has chosen to retire to or have a second home. The eldest daughter of Winston Churchill married Duncan Sandys in 1936 at St. Paul’s Cathedral; Duncan Sandys was instrumental in the UK's hydrogen bomb program. This other former government minister also has a second home located near a location marked by Petre's Bound Stone, a historical parish boundary marker located on Ryder's Hill, which shares a boundary with Buckfastleigh parish. This area is located within a UK National Park in the southwest United Kingdom, whose landscape is dominated by granite from the Cornubian Batholith. What is the name of the former government minister and member of parliament first mentioned?", "true_answer": "Sir Eldon Griffiths"}
